{"book_id": "", "short_book_title": "Dragon's blood by Henry Milner Rideout", "publication_date": 1909, "target_tokens": 50000, "available_tokens": 86762, "split": "test", "text": "Produced by Juliet Sutherland, Sjaani and PG Distributed Proofreaders\n\n\n\n\n\nDRAGON'S BLOOD\n\nby\n\nHENRY MILNER RIDEOUT\n\nwith illustrations by HAROLD M. BRETT\n\n1909\n\n\n\n\nTo\nCHARLES TOWNSEND COPELAND,\n  15 Hollis Hall, Cambridge, Massachusetts\n\nDear Cope,\n\nMr. Peachey Carnehan, when he returned from Kafiristan, in bad shape but\nwith a king's head in a bag, exclaimed to the man in the newspaper\noffice, \"And you've been sitting there ever since!\" There is only a pig\nin the following poke; and yet in giving you the string to cut and the\nbag to open, I feel something of Peachey's wonder to think of you,\nacross all this distance and change, as still sitting in your great\nchair by the green lamp, while past a dim background of books moves the\nprocession of youth. Many of us, growing older in various places,\nremember well your friendship, and are glad that you are there, urging\nour successors to look backward into good books, and forward into life.\n\n    Yours ever truly,\n        H. M. R.\n_Sausalito, California_.\n\n\nCONTENTS\n\n     I. A LADY AND A GRIFFIN\n    II. THE PIED PIPER\n   III. UNDER FIRE\n    IV. THE SWORD-PEN\n     V. IN TOWN\n    VI. THE PAGODA\n   VII. IPHIGENIA\n  VIII. THE HOT NIGHT\n    IX. PASSAGE AT ARMS\n     X. THREE PORTALS\n    XI. WHITE LOTUS\n   XII. THE WAR BOARD\n  XIII. THE SPARE MAN\n   XIV. OFF DUTY\n    XV. KAU FAI\n   XVI. THE GUNWALE\n  XVII. LAMP OF HEAVEN\n XVIII. SIEGE\n   XIX. BROTHER MOLES\n    XX. THE HAKKA BOAT\n   XXI. THE DRAGON'S SHADOW\n\n\nILLUSTRATIONS\n\n_\"Good-by! A pleasant voyage\"_ ... Frontispiece\n\n_Rudolph was aware of crowded bodies, of yellow faces grinning_\n\n_He let the inverted cup dangle from his hands_\n\n_He went leaping from sight over the crest_\n\n\n\nCHAPTER I\n\n\nA LADY AND A GRIFFIN\n\nIt was \"about first-drink time,\" as the captain of the Tsuen-Chau, bound\nfor Shanghai and Japan ports, observed to his friend Cesare Domenico, a\ngood British subject born at Malta. They sat on the coolest corner in\nPort Said, their table commanding both the cross-way of Chareh Sultan el\nOsman, and the short, glaring vista of desert dust and starved young\nacacias which led to the black hulks of shipping in the Canal. From the\nBar la Poste came orchestral strains--\"Ai nostri monti\"--performed by a\npiano indoors and two violins on the pavement. The sounds contended with\na thin, scattered strumming of cafe mandolins, the tinkle of glasses,\nthe steady click of dominoes and backgammon; then were drowned in the\nharsh chatter of Arab coolies who, all grimed as black as Nubians, and\nshouldering spear-headed shovels, tramped inland, their long tunics\nstiff with coal-dust, like a band of chain-mailed Crusaders lately\ncaught in a hurricane of powdered charcoal. Athwart them, Parisian\ngowns floated past on stout Italian forms; hulking third-class\nAustralians, in shirtsleeves, slouched along toward their mail-boat,\nhugging whiskey bottles, baskets of oranges, baskets of dates; British\nsoldiers, khaki-clad for India, raced galloping donkeys through the\ncrowded and dusty street. It was mail-day, and gayety flowed among the\ntables, under the thin acacias, on a high tide of Amer Picon.\n\nThrough the inky files of the coaling-coolies burst an alien and\nbewildered figure. He passed unnoticed, except by the filthy little Arab\nbootblacks who swarmed about him, trotting, capering, yelping\ncheerfully: \"Mista Ferguson!--polish, finish!--can-can--see nice Frencha\ngirl--Mista McKenzie, Scotcha fella from Dublin--smotta picture--polish,\nfinish!\"--undertoned by a squabbling chorus. But presently, studying his\nface, they cried in a loud voice, \"Nix! Alles!\" and left him, as one not\ndesiring polish.\n\n\"German, that chap,\" drawled the captain of the Tsuen-Chau, lazily,\nnoticing the uncertain military walk of the young man's clumsy legs, his\nuncouth clothes, his pale visage winged by blushing ears of coral pink.\n\n\"The Eitel's in, then,\" replied Cesare. And they let the young Teuton\nvanish in the vision of mixed lives.\n\nDown the lane of music and chatter and drink he passed slowly, like a\nman just wakened,--assailed by Oriental noise and smells, jostled by the\nraces of all latitudes and longitudes, surrounded and solitary, unheeded\nand self-conscious. With a villager's awkwardness among crowds, he made\nhis way to a German shipping-office.\n\n\"Dispatches for Rudolph Hackh?\" he inquired, twisting up his blond\nmoustache, and trying to look insolent and peremptory, like an\nemployer of men.\n\n\"There are none, sir,\" answered an amiable clerk, not at all impressed.\n\nAbashed once more in the polyglot street, still daunted by his first\nplunge into the foreign and the strange, he retraced his path, threading\nshyly toward the Quai Francois Joseph. He slipped through the barrier\ngate, signaled clumsily to a boatman, crawled under the drunken little\nawning of the dinghy, and steered a landsman's course along the shining\nCanal toward the black wall of a German mail-boat. Cramping the Arab's\noar along the iron side, he bumped the landing-stage. Safe on deck, he\nbecame in a moment stiff and haughty, greeting a fellow passenger here\nand there with a half-military salute. All afternoon he sat or walked\nalone, unapproachable, eyeing with a fierce and gloomy stare the\nsqualid front of wooden houses on the African side, the gray desert\nglare of Asia, the pale blue ribbon of the great Canal stretching\nsouthward into the unknown.\n\nHe composed melancholy German verses in a note-book. He recalled famous\nexiles--Camoens, Napoleon, Byron--and essayed to copy something of all\nthree in his attitude. He cherished the thought that he, clerk at\ntwenty-one, was now agent at twenty-two, and traveling toward a house\nwith servants, off there beyond the turn of the Canal, beyond the curve\nof the globe. But for all this, Rudolph Hackh felt young, homesick,\ntimid of the future, and already oppressed with the distance, the age,\nthe manifold, placid mystery of China.\n\nToward that mystery, meanwhile, the ship began to creep. Behind her,\nhouses, multi- funnels, scrubby trees, slowly swung to blot out\nthe glowing Mediterranean and the western hemisphere. Gray desert banks\nclosed in upon her strictly, slid gently astern, drawing with them to\nthe vanishing-point the bright lane of traversed water. She gained the\nBitter Lakes; and the red conical buoys, like beads a-stringing, slipped\non and added to the two converging dotted lines.\n\n\"Good-by to the West!\" thought Rudolph. As he mourned sentimentally at\nthis lengthening tally of their departure, and tried to quote\nappropriate farewells, he was deeply touched and pleased by the sadness\nof his emotions. \"Now what does Byron say?\"\n\nThe sombre glow of romantic sentiment faded, however, with the sunset.\nThat evening, as the ship glided from ruby coal to ruby coal of the\ngares, following at a steady six knots the theatric glare of her\nsearch-light along arsenically green cardboard banks, Rudolph paced the\ndeck in a mood much simpler and more honest. In vain he tried the\nhalf-baked philosophy of youth. It gave no comfort; and watching the\nclear desert stars of two mysterious continents, he fell prey to the\nunbounded and unintelligible complexity of man's world. His own career\nseemed no more dubious than trivial.\n\nSucceeding days only strengthened this mood. The Red Sea passed in a\ndream of homesickness, intolerable heat, of a pale blue surface\nstretched before aching eyes, and paler strips of pink and gray coast,\nfaint and distant. Like dreams, too, passed Aden and Colombo; and then,\nsuddenly, he woke to the most acute interest.\n\nHe had ignored his mess-mates at their second-class table; but when the\nnew passengers from Colombo came to dinner, he heard behind him the\nswish of stiff skirts, felt some one brush his shoulder, and saw,\nsliding into the next revolving chair, the vision of a lady in white.\n\n\"_Mahlzeit_\" she murmured dutifully. But the voice was not German.\nRudolph heard her subside with little flouncings, and felt his ears grow\nwarm and red. Delighted, embarrassed, he at last took sufficient courage\nto steal side-glances.\n\nThe first showed her to be young, fair-haired, and smartly attired in\nthe plainest and coolest of white; the second, not so young, but very\ncharming, with a demure downcast look, and a deft control of her spoon\nthat, to Rudolph's eyes, was splendidly fastidious; at the third, he was\nshocked to encounter the last flitting light of a counter-glance, from\nlarge, dark-blue eyes, not devoid of amusement.\n\n\"She laughs at me!\" fumed the young man, inwardly. He was angry,\nconscious of those unlucky wing-and-wing ears, vexed at his own\nboldness. \"I have been offensive. She laughs at me.\" He generalized from\nlong inexperience of a subject to which he had given acutely interested\nthought: \"They always do.\"\n\nAnger did not prevent him, however, from noting that his neighbor\ntraveled alone, that she must be an Englishwoman, and yet that she\ndiffused, somehow, an aura of the Far East and of romance. He shot many\na look toward her deck-chair that evening, and when she had gone below,\nstrategically bought a cigar, sat down in the chair to light it, and by\na carefully shielded match contrived to read the tag that fluttered on\nthe arm: \"B. Forrester, Hongkong.\"\n\nAfterward he remembered that by early daylight he might have read it for\nnothing; and so, for economic penance, smoked to the bitter end, finding\nthe cigar disagreeable but manly. At all events, homesickness had\nvanished in a curious impatience for the morrow. Miss Forrester: he\nwould sit beside Miss Forrester at table. If only they both were\ntraveling first-class!--then she might be a great lady. To be enamored\nof a countess, now--A cigar, after all, was the proper companion of\nbold thoughts.\n\nAt breakfast, recalling her amusement, he remained silent and wooden. At\ntiffin his heart leaped.\n\n\"You speak English, I'm sure, don't you?\" Miss Forrester was saying, in\na pleasant, rather drawling voice. Her eyes were quite serious now, and\nindeed friendly. Confusion seized him.\n\n\"I have less English to amuse myself with the ladies,\" he answered\nwildly. Next moment, however, he regained that painful mastery of the\ntongue which had won his promotion as agent, and stammered: \"Pardon. I\nwould mean, I speak so badly as not to entertain her.\"\n\n\"Indeed, you speak very nicely,\" she rejoined, with such a smile as no\nwoman had ever troubled to bestow on him. \"That will be so pleasant,\nfor my German is shocking.\"\n\nDazed by the compliment, by her manner of taking for granted that future\nconversation which had seemed too good to come true, but above all by\nher arch, provoking smile, Rudolph sat with his head in a whirl, feeling\nthat the wide eyes of all the second-cabiners were penetrating the\ntumultuous secret of his breast. Again his English deserted, and left\nhim stammering. But Miss Forrester chatted steadily, appeared to\nunderstand murmurs which he himself found obscure, and so restored his\nconfidence that before tiffin was over he talked no less gayly, his\nhonest face alight and glowing. She taught him the names of the strange\nfruits before them; but though listening and questioning eagerly, he\ncould not afterward have told loquat from pumelo, or custard-apple\nfrom papaya.\n\nNor could this young man, of methodical habits, ever have told how long\ntheir voyage lasted. It passed, unreal and timeless, in a glorious mist,\na delighted fever: the background a blur of glossy white bulkheads and\niron rails, awnings that fluttered in the warm, languorous winds, an\ninfinite tropic ocean poignantly blue; the foreground, Miss Forrester.\nHer white figure, trim and dashing; her round blue eyes, filled with coy\nwonder, the arch innocence of a spoiled child; her pale, smooth cheeks,\nrather plump, but coming oddly and enticingly to a point at the mouth\nand tilted chin; her lips, somewhat too full, too red, but quick and\nwhimsical: he saw these all, and these only, in a bright focus,\nlistening meanwhile to a voice by turns languid and lively, with now and\nthen a curious liquid softness, perhaps insincere, yet dangerously\npleasant. Questioning, hinting, she played at motherly age and wisdom.\nAs for him, he never before knew how well he could talk, or how\nengrossing his sober life, both in his native village on the Baltic and\nafterward in Bremen, could prove to either himself or a stranger.\n\nYet he was not such a fool, he reflected, as to tell everything. So far\nfrom trading confidences, she had told him only that she was bound\nstraight on to Hongkong; that curiosity alone had led her to travel\nsecond-class, \"for the delightful change, you know, from all such\nformality\"; and that she was \"really more French than English.\" Her\nreticence had the charm of an incognito; and taking this leaf from her\nbook, he gave himself out as a large, vaguely important person\njourneying on a large, vague errand.\n\n\"But you are a griffin?\" she had said, as they sat together at tea.\n\n\"Pardon?\" he ventured, wary and alarmed, wondering whether he could\nclaim this unknown term as in character with his part.\n\n\"I mean,\" Miss Forrester explained, smiling, \"it is your first visit to\nthe Far East?\"\n\n\"Oh, yes,\" he replied eagerly, blushing. He would have given worlds to\nsay, \"No.\"\n\n\"Griffins are such nice little monsters,\" she purred. \"I like them.\"\n\nSometimes at night, waked by the snores of a fat Prussian in the upper\nberth, he lay staring into the dark, while the ship throbbed in unison\nwith his excited thoughts. He was amazed at his happy recklessness. He\nwould never see her again; he was hurrying toward lonely and uncertain\nshores; yet this brief voyage outvalued the rest of his life.\n\nIn time, they had left Penang,--another unheeded background for her\narch, innocent, appealing face,--and forged down the Strait of Malacca\nin a flood of nebulous moonlight. It was the last night out from\nSingapore. That veiled brightness, as they leaned on the rail, showed\nher brown hair fluttering dimly, her face pale, half real, half magical,\nher eyes dark and undefined pools of mystery. It was late; they had been\nsilent for a long time; and Rudolph felt that something beyond the\nterritory of words remained to be said, and that the one brilliant epoch\nof his life now drew madly to a close.\n\n\"What do you think of it all?\" the woman asked suddenly, gravely, as\nthough they had been isolated together in the deep spaces of the\nsame thought.\n\n\"I do not yet--Of what?\" rejoined Rudolph, at a loss.\n\n\"Of all this.\" She waved an eloquent little gesture toward the\nazure-lighted gulf.\n\n\"Oh,\" he said. \"Of the world?\"\n\n\"Yes,\" she answered slowly. \"The world. Life.\" Her tone, subdued and\nmusical, conveyed in the mere words their full enigma and full meaning.\n\"All this that we see.\"\n\n\"Who can tell?\" He took her seriously, and ransacked all his store of\nsecond-hand philosophy for a worthy answer,--a musty store, dead and\npedantic, after the thrilling spirit of her words. \"Why, I think--it\nis--is it not all now the sense-manifest substance of our duty? Pardon.\nI am obscure. '_Das versinnlichte Material unserer Pflicht_' No?\"\n\nHer clear laughter startled him.\n\n\"Oh, how moral!\" she cried. \"What a highly moral little griffin!\"\n\nShe laughed again (but this time it was like the splash of water in a\ndeep well), and turned toward him that curiously tilted point of chin\nand mouth, her eyes shadowy and mocking. She looked young again,--the\nspirit of youth, of knowledge, of wonderful brightness and unbelief.\n\n\"Must we take it so very, very hard?\" she coaxed. \"Isn't it just a place\nto be happy in?\"\n\nAs through a tumult he heard, and recognized the wisdom of the ages.\n\n\"Because,\" she added, \"it lasts such a little while--\"\n\nOn the rail their hands suddenly touched. He was aware of nothing but\nthe nearness and pallor of her face, the darkness of her eyes shining up\nat him. All his life seemed to have rushed concentrating into that one\ninstant of extreme trouble, happiness, trembling fascination.\n\nFootsteps sounded on the deck behind them; an unwelcome voice called\njocosely:--\n\n\"Good efening!\" The ship's doctor advanced with a roguish, paternal air.\n\"You see at the phosphor, not?\"\n\nEven as she whipped about toward the light, Rudolph had seen, with a\ntouch of wonder, how her face changed from a bitter frown to the most\nfriendly smile. The frown returned, became almost savage, when the fat\nphysician continued:--\n\n\"To see the phosphor is too much moon, Mrs. Forrester?\"\n\nHad the steamer crashed upon a reef, he would hardly have noticed such a\nminor shipwreck. Mrs. Forrester? why, then--When the doctor, after\nponderous pleasantries, had waddled away aft, Rudolph turned upon her a\nface of tragedy.\n\n\"Was that true?\" he demanded grimly.\n\n\"Was what true?\" she asked, with baby eyes of wonder, which no longer\ndeceived, but angered.\n\n\"What the doctor said.\" Rudolph's voice trembled. \"The tittle--the title\nhe gave you.\"\n\n\"Why, of course,\" she laughed.\n\n\"And you did not tell me!\" he began, with scorn.\n\n\"Don't be foolish,\" she cut in. From beneath her skirt the toe of a\nsmall white shoe tapped the deck angrily. Of a sudden she laughed, and\nraised a tantalizing face, merry, candid, and inscrutable. \"Why, you\nnever asked me, and--and of course I thought you were saying it all\nalong. You have such a dear, funny way of pronouncing, you know.\"\n\nHe hesitated, almost believing; then, with a desperate gesture, wheeled\nand marched resolutely aft. That night it was no Prussian snores which\nkept him awake and wretched. \"Everything is finished,\" he thought\nabysmally. He lay overthrown, aching, crushed, as though pinned under\nthe fallen walls of his youth.\n\nAt breakfast-time, the ship lay still beside a quay where mad crowds of\nbrown and yellow men, scarfed, swathed, and turbaned in riotous colors,\nworked quarreling with harsh cries, in unspeakable interweaving uproar.\nThe air, hot and steamy, smelled of strange earth. As Rudolph followed a\nMalay porter toward the gang-plank, he was painfully aware that Mrs.\nForrester had turned from the rail and stood waiting in his path.\n\n\"Without saying good-by?\" she reproached him. The injured wonder in her\neyes he thought a little overdone.\n\n\"Good-by.\" He could not halt, but, raising his cap stiffly, managed to\nadd, \"A pleasant voyage,\" and passed on, feeling as though she had\nmurdered something.\n\nHe found himself jogging in a rickshaw, while equatorial rain beat like\ndown-pouring bullets on the tarpaulin hood, and sluiced the Chinaman's\noily yellow back. Over the heavy-muscled shoulders he caught glimpses of\nsullen green foliage, ponderous and drooping; of half-naked barbarians\nthat squatted in the shallow caverns of shops; innumerable faces, black,\nyellow, white, and brown, whirling past, beneath other tarpaulin hoods,\nor at carriage windows, or shielded by enormous dripping wicker hats, or\nbared to the pelting rain. Curious odors greeted him, as of sour\nvegetables and of unknown rank substances burning. He stared like a\nvisionary at the streaming multitude of alien shapes.\n\nThe coolie swerved, stopped, tilted his shafts to the ground. Rudolph\nentered a sombre, mouldy office, where the darkness rang with tiny\nsilver bells. Pig-tailed men in skull-caps, their faces calm as polished\nivory, were counting dollars endlessly over flying finger-tips. One of\nthese men paused long enough to give him a sealed dispatch,--the message\nto which the ocean-bed, the Midgard ooze, had thrilled beneath his\ntardy keel.\n\n\"Zimmerman recalled,\" the interpretation ran; \"take his station; proceed\nat once.\"\n\nHe knew the port only as forlorn and insignificant. It did not matter.\nOne consolation remained: he would never see her again.\n\n\n\nCHAPTER II\n\n\nTHE PIED PIPER\n\nA gray smudge trailing northward showed where the Fa-Hien--Scottish\nOriental, sixteen hundred tons--was disappearing from the pale expanse\nof ocean. The sampan drifted landward imperceptibly, seeming, with\nnut-brown sail unstirred, to remain where the impatient steamer had met\nit, dropped a solitary passenger overside, and cast him loose upon the\nbreadth of the antipodes. Rare and far, the sails of junks patched the\nhorizon with umber polygons. Rudolph, sitting among his boxes in the\nsampan, viewed by turns this desolate void astern and the more desolate\nsweep of coast ahead. His matting sail divided the shining bronze\noutpour of an invisible river, divided a low brown shore beyond, and\nabove these, the strips of some higher desert country that shone like\nsnowdrifts, or like sifted ashes from which the hills rose black and\ncharred. Their savage, winter-blasted look, in the clear light of an\nalmost vernal morning, made the land seem fabulous. Yet here in reality,\nthought Rudolph, as he floated toward that hoary kingdom,--here at last,\nfacing a lonely sea, reared the lifeless, inhospitable shore, the\nsullen margin of China.\n\nThe slow creaking of the spliced oar, swung in its lashing by a\nhalf-naked yellow man, his incomprehensible chatter with some fellow\nboatman hidden in the bows, were sounds lost in a drowsy silence,\nrhythms lost in a wide inertia. Time itself seemed stationary. Rudolph\nnodded, slept, and waking, found the afternoon sped, the hills gone, and\nhis clumsy, time-worn craft stealing close under a muddy bank topped\nwith brown weeds and grass. They had left behind the silted roadstead,\nand now, gliding on a gentle flood, entered the river-mouth. Here and\nthere, against the saffron tide, or under banks quaggy as melting\nchocolate, stooped a naked fisherman, who--swarthy as his background but\nfor a loin-band of yellow flesh--shone wet and glistening while he\nstirred a dip-net through the liquid mud. Faint in the distance harsh\ncries sounded now and then, and the soft popping of small-arms,--tiny\nrevolts in the reign of a stillness aged and formidable. Crumbling walls\nand squat ruins, black and green-patched with mould--old towers of\ndefense against pirates--guarded from either bank the turns of the\nriver. In one reach, a \"war-junk,\" her sails furled, lay at anchor, the\nred and white eyes staring fish-like from her black prow: a silly\nmonster, the painted tompions of her wooden cannon aiming drunkenly\naskew, her crew's wash fluttering peacefully in a line of blue dungaree.\n\nBeyond the next turn, a fowling-piece cracked sharply, close at hand;\nsomething splashed, and the ruffled body of a snipe bobbed in the bronze\nflood alongside.\n\n\"Hang it!\" complained a voice, loudly. \"The beggar was too--Hallo! Oh, I\nsay, Gilly! Gilly, ahoy! Pick us up, there's a good chap! The bird\nfirst, will you, and then me.\"\n\nA tall young man in brown holland and a battered _terai_ stood above on\nthe grassy brink.\n\n\"Oh, beg pardon,\" he continued. \"Took you for old Gilly, you know.\" He\nsnapped the empty shells from his gun, and blew into the breech, before\nadding, \"Would _you_ mind, then? That is, if you're bound up for\nStink-Chau. It's a beastly long tramp, and I've been shooting all\nafternoon.\"\n\nFollowed by three coolies who popped out of the grass with game-bags,\nthe young stranger descended, hopped nimbly from tussock to gunwale, and\nperched there to wash his boots in the river.\n\n\"Might have known you weren't old Gilly,\" he said over his shoulder.\n\"Wutzler said the Fa-Hien lay off signaling for sampan before breakfast.\nGoing to stay long?\"\n\n\"I am agent,\" answered Rudolph, with a touch of pride, \"for Fliegelman\nand Sons.\"\n\n\"Oh?\" drawled the hunter, lazily. He swung his legs inboard, faced\nabout, and studied Rudolph with embarrassing frankness. He was a\nlong-limbed young Englishman, whose cynical gray eyes, and thin face\ntinged rather sallow and Oriental, bespoke a reckless good humor. \"Life\nsentence, eh? Then your name's--what is it again?--Hackh, isn't it?\nHeywood's mine. So you take Zimmerman's place. He's off already, and\ngood riddance. He _was_ a bounder!--Charming spot you've come to! I\ndaresay if your Fliegelmans opened a hong in hell, you might possibly\nget a worse station.\"\n\nWithout change of manner, he uttered a few gabbling, barbaric words. A\ncoolie knelt, and with a rag began to clean the boots, which, from the\nexpression of young Mr. Heywood's face, were more interesting than the\narrival of a new manager from Germany.\n\n\"It will be dark before we're in,\" he said. \"My place for the night, of\ncourse, and let your predecessor's leavings stand over till daylight.\nAfter dinner we'll go to the club. Dinner! Chicken and rice, chicken and\nrice! Better like it, though, for you'll eat nothing else, term of\nyour life.\"\n\n\"You are very kind,\" began Rudolph; but this bewildering off-hand\nyoungster cut him short, with a laugh:--\n\n\"No fear, you'll pay me! Your firm supplies unlimited liquor. Much good\nthat ever did us, with old Zimmerman.\"\n\nThe sampan now slipped rapidly on the full flood, up a narrow channel\nthat the setting of the sun had turned, as at a blow, from copper to\nindigo. The shores passed, more and more obscure against a fading light.\nA star or two already shone faint in the lower spaces. A second war-junk\nloomed above them, with a ruddy fire in the stern lighting a glimpse of\nsquat forms and yellow goblin faces.\n\n\"It is very curious,\" said Rudolph, trying polite conversation, \"how\nthey paint so the eyes on their jonks.\"\n\n\"No eyes, no can see; no can see, no can walkee,\" chanted Heywood in\ncareless formula. \"I say,\" he complained suddenly, \"you're not going to\n'study the people,' and all that rot? We're already fed up with\nmissionaries. Their cant, I mean; no allusion to cannibalism.\"\n\nHe lighted a cigarette. After the blinding flare of the match, night\nseemed to have fallen instantaneously. As their boat crept on to the\nslow creaking sweep, both maintained silence, Rudolph rebuked and\nlonely, Heywood supine beneath a comfortable winking spark.\n\n\"What I mean is,\" drawled the hunter, \"we need all the good fellows we\ncan get. Bring any new songs out? Oh, I forgot, you're a German, too.--A\nsweet little colony! Gilly's the only gentleman in the whole half-dozen\nof us, and Heaven knows he's not up to much.--Ah, we're in. On our\nright, fellow sufferers, we see the blooming Village of Stinks.\"\n\nHe had risen in the gloom. Beyond his shadow a few feeble lights burned\nlow and scattered along the bank. Strange cries arose, the bumping of\nsampans, the mournful caterwauling of a stringed instrument.\n\n\"The native town's a bit above,\" he continued. \"We herd together here on\nthe edge. No concession, no bund, nothing.\"\n\nTheir sampan grounded softly in malodorous ooze. Each mounting the bare\nshoulders of a coolie, the two Europeans rode precariously to shore.\n\n\"My boys will fetch your boxes,\" called Heywood. \"Come on.\"\n\nThe path, sometimes marshy, sometimes hard-packed clay or stone flags\ndeeply littered, led them a winding course in the night. Now and then\nshapes met them and pattered past in single file, furtive and sinister.\nAt last, where a wall loomed white, Heywood stopped, and, kicking at a\nwooden gate, gave a sing-song cry. With rattling weights, the door\nswung open, and closed behind them heavily. A kind of empty garden, a\nbare little inclosure, shone dimly in the light that streamed from a\nlow, thick-set veranda at the farther end. Dogs flew at them, barking\noutrageously.\n\n\"Down, Chang! Down, Chutney!\" cried their master. \"Be quiet, Flounce,\nyou fool!\"\n\nOn the stone floor of the house, they leaped upon him, two red chows and\na fox-terrier bitch, knocking each other over in their joy.\n\n\"Olo she-dog he catchee plenty lats,\" piped a little Chinaman, who\nshuffled out from a side-room where lamplight showed an office desk.\n\"Too-day catchee. Plenty lats. No can.\"\n\n\"My compradore, Ah Pat,\" said Heywood to Rudolph. \"Ah Pat, my friend he\nb'long number one Flickleman, boss man.\"\n\nThe withered little creature bobbed in his blue robe, grinning at the\nintroduction.\n\n\"You welly high-tone man,\" he murmured amiably. \"Catchee goo' plice.\"\n\n\"All the same, I don't half like it,\" was Heywood's comment later. He\nhad led his guest upstairs into a bare white-washed room, furnished in\nwicker. Open windows admitted the damp sea breeze and a smell, like foul\ngun-barrels, from the river marshes. \"Where should all the rats be\ncoming from?\" He frowned, meditating on what Rudolph thought a trifle.\nAbove the sallow brown face, his chestnut hair shone oddly,\nclose-cropped and vigorous. \"Maskee, can't be helped.--O Boy, one\nsherry-bitters, one bamboo!\"\n\n\"To our better acquaintance,\" said Rudolph, as they raised their\nglasses.\n\n\"What? Oh, yes, thanks,\" the other laughed. \"Any one would know you for\na griffin here, Mr. Hackh. You've not forgotten your manners yet.\"\n\nWhen they had sat down to dinner in another white-washed room, and had\nundertaken the promised rice and chicken, he laughed again,\nsomewhat bitterly.\n\n\"Better acquaintance--no fear! You'll be so well acquainted with us all\nthat you'll wish you never clapped eyes on us.\" He drained his whiskey\nand soda, signaled for more, and added: \"Were you ever cooped up,\nyachting, with a chap you detested? That's the feeling you come to\nhave.--Here, stand by. You're drinking nothing.\"\n\nRudolph protested. Politeness had so far conquered habit, that he felt\nuncommonly flushed, genial, and giddy.\n\n\"That,\" urged Heywood, tapping the bottle, \"that's our only amusement.\nYou'll see. One good thing we can get is the liquor. 'Nisi damnose\nbibimus,'--forget how it runs: 'Drink hearty, or you'll die without\ngetting your revenge,'\"\n\n\"You are then a university's-man?\" cried Rudolph, with enthusiasm.\n\nThe other nodded gloomily. On the instant his face had fallen as\nimpassive as that of the Chinese boy who stood behind his chair,\nstraight, rigid, like a waxen image of Gravity in a blue gown.--\"Yes, of\nsorts. Young fool. Scrapes. Debt. Out to Orient. Same old story. More\ndebt. Trust the firm to encourage that! Debt and debt and debt. Tied up\nsafe. Transfer. Finish! Never go Home.\"--He rose with a laugh and an\nimpatient gesture.--\"Come on. Might as well take in the club as to sit\nhere talking rot.\"\n\nOutside the gate of the compound, coolies crouching round a lantern\nsprang upright and whipped a pair of sedan-chairs into position.\nHeywood, his feet elevated comfortably over the poles, swung in the\nlead; Rudolph followed, bobbing in the springy rhythm of the long\nbamboos. The lanterns danced before them down an open road, past a few\nblank walls and dark buildings, and soon halted before a whitened front,\nwhere light gleamed from the upper story.\n\n\"Mind the stairs,\" called Heywood. \"Narrow and beastly dark.\"\n\nAs they stumbled up the steep flight, Rudolph heard the click of\nbilliard balls. A pair of hanging lamps lighted the room into which he\nrose,--a low, gloomy loft, devoid of comfort. At the nearer table, a\nweazened little man bent eagerly over a pictorial paper; at the farther,\nchalking their cues, stood two players, one a sturdy Englishman with a\ngray moustache, the other a lithe, graceful person, whose blue coat,\nsmart as an officer's, and swarthy but handsome face made him at a\nglance the most striking figure in the room. A little Chinese imp in\nwhite, who acted as marker, turned on the new-comers a face of\npreternatural cunning.\n\n\"Mr. Wutzler,\" said Heywood. The weazened reader rose in a nervous\nflutter, underwent his introduction to Rudolph with as much bashful\nagony as a school-girl, mumbled a few words in German, and instantly\ntook refuge in his tattered _Graphic_. The players, however, advanced in\na more friendly fashion. The Englishman, whose name Rudolph did not\ncatch, shook his hand heartily.\n\n\"Mr. Hackh is a welcome addition.\" He spoke with deliberate courtesy.\nSomething in his voice, the tired look in his frank blue eyes and\nserious face, at once engaged respect. \"For our sakes,\" he continued,\n\"we're glad to see you here. I am sure Doctor Chantel will agree\nwith me.\"\n\n\"Ah, indeed,\" said the man in military blue, with a courtier's bow.\nBoth air and accent were French. \"Most welcome.\"\n\n\"Let's all have a drink,\" cried Heywood. Despite his many glasses at\ndinner, he spoke with the alacrity of a new idea. \"O Boy, whiskey\n_Ho-lan suey, fai di_!\"\n\nAway bounded the boy marker like a tennis-ball.\n\n\"Hello, Wutzler's off already!\"--The little old reader had quietly\ndisappeared, leaving them a vacant table.--\"Isn't he weird?\" laughed\nHeywood, as they sat down. \"Comes and goes like a ghost.\"\n\n\"It is his Chinese wife,\" declared Chantel, preening his moustache. \"He\nis always ashame to meet the new persons.\"\n\n\"Poor old chap,\" said Heywood. \"I know--feels himself an outcast and all\nthat. Humph! With us! Quite unnecessary.\"--The Chinese page, quick,\nsolemn, and noiseless, glided round the table with his tray.--\"Ah, you\nyoung devil! You're another weird one, you atom. See those bead eyes\nwatching us, eh? A Gilpin Homer, you are, and some fine day we'll see\nyou go off in a flash of fire. If you don't poison us all first.--Well,\nhere's fortune!\"\n\n\"Your health, Mr. Hackh,\" amended the other Englishman.\n\nAs they set down their glasses, a strange cry sounded from below,--a\nstifled call, inarticulate, but in such a key of distress that all four\nfaced about, and listened intently.\n\n\"Kom down,\" called a hesitating voice, \"kom down and look-see.\"\n\nThey sprang to the stairs, and clattered downward. Dim radiance flooded\nthe landing, from the street door. Outside, a smoky lantern on the\nground revealed the lower levels.\n\nIn the wide sector of light stood Wutzler, shrinking and apologetic,\nlike a man caught in a fault, his wrinkled face eloquent of fear, his\ngesture eloquent of excuse. Round him, as round a conjurer, scores of\nlittle shadowy things moved in a huddling dance, fitfully hopping like\nsparrows over spilt grain. Where the light fell brightest these became\nplainer, their eyes shone in jeweled points of color.\n\n\"By Jove, Gilly, they are rats!\" said Heywood, in a voice curiously\nforced and matter-of-fact. \"Flounce killed several this afternoon,\nso my--\"\n\nNo one heeded him; all stared. The rats, like beings of incantation,\nstole about with an absence of fear, a disregard of man's presence, that\nwas odious and alarming.\n\n\"Earthquake?\" The elder Englishman spoke as though afraid of disturbing\nsome one.\n\nThe French doctor shook his head.\n\n\"No,\" he answered in the same tone. \"Look.\"\n\nThe rats, in all their weaving confusion, displayed one common impulse.\nThey sprang upward continually, with short, agonized leaps, like\ndrowning creatures struggling to keep afloat above some invisible flood.\nThe action, repeated multitudinously into the obscure background,\nexaggerated in the foreground by magnified shadows tossing and falling\non the white walls, suggested the influence of some evil stratum, some\nvapor subtle and diabolic, crawling poisonously along the ground.\n\nHeywood stamped angrily, without effect. Wutzler stood abject, a\nmagician impotent against his swarm of familiars. Gradually the rats,\nsilent and leaping, passed away into the darkness, as though they heard\nthe summons of a Pied Piper.\n\n\"It doesn't attack Europeans.\" Heywood still used that curious\ninflection.\n\n\"Then my brother Julien is still alive,\" retorted Doctor Chantel,\nbitterly.\n\n\"What do you think, Gilly?\" persisted Heywood.\n\nHis compatriot nodded in a meaningless way.\n\n\"The doctor's right, of course,\" he answered. \"I wish my wife weren't\ncoming back.\"\n\n\"Dey are a remember,\" ventured Wutzler, timidly. \"A warnung.\"\n\nThe others, as though it had been a point of custom, ignored him. All\nstared down, musing, at the vacant stones.\n\n\"Then the concert's off to-morrow night,\" mocked Heywood, with an\nunpleasant laugh.\n\n\"On the contrary.\" Gilly caught him up, prompt and decided. \"We shall\nneed all possible amusements; also to meet and plan our campaign.\nMeantime,--what do you say, Doctor?--chloride of lime in pots?\"\n\n\"That, evidently,\" smiled the handsome man. \"Yes, and charcoal burnt in\nbraziers, perhaps, as Pere Fenouil advises. Fumigate.\"--Satirical and\ndebonair, he shrugged his shoulders.--\"What use, among these thousands\nof yellow pigs?\"\n\n\"I wish she weren't coming,\" repeated Gilly.\n\nRudolph, left outside this conference, could bear the uncertainty no\nlonger.\n\n\"I am a new arrival,\" he confided to his young host. \"I do not\nunderstand. What is it?\"\n\n\"The plague, old chap,\" replied Heywood, curtly. \"These playful little\nanimals get first notice. You're not the only arrival to-night.\"\n\n\n\nCHAPTER III\n\n\nUNDER FIRE\n\nThe desert was sometimes Gobi, sometimes Sahara, but always an infinite\nstretch of sand that floated up and up in a stifling layer, like the\ntide. Rudolph, desperately choked, continued leaping upward against an\ninsufferable power of gravity, or straining to run against the force of\nparalysis. The desert rang with phantom voices,--Chinese voices that\nmocked him, chanting of pestilence, intoning abhorrently in French.\n\nHe woke to find a knot of bed-clothes smothering him. To his first\nunspeakable relief succeeded the astonishment of hearing the voices\ncontinue in shrill chorus, the tones Chinese, the words, in louder\nfragments, unmistakably French. They sounded close at hand, discordant\nmatins sung by a mob of angry children. Once or twice a weary, fretful\nvoice scolded feebly: \"Un-peu-de-s'lence! Un-peu-de-s'lence!\" Rudolph\nrose to peep through the heavy jalousies, but saw nothing more than\nsullen daylight, a flood of vertical rain, and thin rivulets coursing\ndown a tiled roof below. The morning was dismally cold.\n\n\"Jolivet's kids wake you?\" Heywood, in a blue kimono, nodded from the\ndoorway. \"Public nuisance, that school. Quite needless, too. Some bally\nFrench theory, you know, sphere of influence, and that rot. Game played\nout up here, long ago, but they keep hanging on.--Bath's ready, when you\nlike.\" He broke out laughing. \"Did you climb into the water-jar,\nyesterday, before dinner? Boy reports it upset. You'll find the dipper\nmore handy.--How did you ever manage? One leg at a time?\"\n\nEchoes of glee followed his disappearance. Rudolph, blushing, prepared\nto descend into the gloomy vault of ablution. Charcoal fumes, however,\nand the glow of a brazier on the dark floor below, not only revived all\nhis old terror, but at the stair-head halted him with a new.\n\n\"Is the water safe?\" he called.\n\nHeywood answered impatiently from his bedroom.\n\n\"Nothing safe in this world, Mr. Hackh. User's risk.\" An inaudible\nmutter ended with, \"Keep clean, anyway.\"\n\nAt breakfast, though the acrid smoke was an enveloping reminder, he made\nthe only reference to their situation.\n\n\"Rain at last: too late, though, to flush out the gutters. We needed it\na month ago.--I say, Hackh, if you don't mind, you might as well cheer\nup. From now on, it's pure heads and tails. We're all under fire\ntogether.\" Glancing out of window at the murky sky, he added\nthoughtfully, \"One excellent side to living without hope, maskee\nfashion: one isn't specially afraid. I'll take you to your office, and\nyou can make a start. Nothing else to do, is there?\"\n\nDripping bearers and shrouded chairs received them on the lower floor,\ncarried them out into a chill rain that drummed overhead and splashed\nalong the compound path in silver points. The sunken flags in the road\nformed a narrow aqueduct that wavered down a lane of mire. A few\ngrotesque wretches, thatched about with bamboo matting, like bottles, or\nlike rosebushes in winter, trotted past shouldering twin baskets. The\nsmell of joss-sticks, fish, and sour betel, the subtle sweetness of\nopium, grew constantly stronger, blended with exhalations of ancient\nrefuse, and (as the chairs jogged past the club, past filthy groups\nhuddling about the well in a marketplace, and onward into the black yawn\nof the city gate) assailed the throat like a bad and lasting taste. Now,\nin the dusky street, pent narrowly by wet stone walls, night seemed to\nfall, while fresh waves of pungent odor overwhelmed and steeped the\nsenses. Rudolph's chair jostled through hundreds and hundreds of\nChinese, all alike in the darkness, who shuffled along before with\nswitching queues, or flattened against the wall to stare, almost nose\nto nose, at the passing foreigner. With chairpoles backing into one shop\nor running ahead into another, with raucous cries from the coolies, he\nswung round countless corners, bewildered in a dark, leprous, nightmare\nbazaar. Overhead, a slit of cloudy sky showed rarely; for the most part,\nhe swayed along indoors, beneath a dingy lattice roof. All points of the\ncompass vanished; all streets remained alike,--the same endless vista of\nmystic characters, red, black, and gold, on narrow suspended tablets,\nunder which flowed the same current of pig-tailed men in blue and dirty\nwhite. From every shop, the same yellow faces stared at him, the same\nelfin children caught his eye for a half-second to grin or grimace, the\nsame shaven foreheads bent over microscopical tasks in the dark. At\nfirst, Rudolph thought the city loud and brawling; but resolving this\nimpression to the hideous shouts of his coolies parting the crowd, he\ndetected, below or through their noise, from all the long\ncross-corridors a wide and appalling silence. Gradually, too, small\nsounds relieved this: the hammering of brass-work, the steady rattle of\na loom, or the sing-song call and mellow bell of some burdened hawker,\nbumping past, his swinging baskets filled with a pennyworth of trifles.\nBut still the silence daunted Rudolph in this astounding vision, this\nmasque of unreal life, of lost daylight, of annihilated direction, of\nplacid turmoil and multifarious identity, made credible only by the\npermanence of nauseous smells.\n\nSomewhere in the dark maze, the chairs halted, under a portal black and\nheavy as a Gate of Dreams. And as by the anachronism of dreams\nthere hung, among its tortuous symbols, the small, familiar\nplacard--\"Fliegelman and Sons, Office.\" Heywood led the way, past two\nducking Chinese clerks, into a sombre room, stone-floored, furnished\nstiffly with a row of carved chairs against the wall, lighted coldly by\nroof-windows of placuna, and a lamp smoking before some commercial god\nin his ebony and tinsel shrine.\n\n\"There,\" he said, bringing Rudolph to an inner chamber, or dark little\npent-house, where another draughty lamp flickered on a European desk.\n\"Here's your cell. I'm off--call for you later. Good luck!\"--Wheeling in\nthe doorway, he tossed a book, negligently.--\"Caught! You may as well\nstart in, eh?--'Cantonese Made Worse,'\"\n\nTo his departing steps Rudolph listened as a prisoner, condemned, might\nlisten to the last of all earthly visitors. Peering through a kind of\nbutler's window, he saw beyond the shrine his two pallid subordinates,\nlike mystic automatons, nodding and smoking by the doorway. Beyond\nthem, across a darker square like a cavern-mouth, flitted the living\nphantoms of the street. It seemed a fit setting for his fears. \"I am\nlost,\" he thought; lost among goblins, marooned in the age of barbarism,\nshut in a labyrinth with a Black Death at once actual and mediaeval: he\ndared not think of Home, but flung his arms on the littered desk, and\nburied his face.\n\nOn the tin pent-roof, the rain trampled inexorably.\n\nAt last, mustering a shaky resolution, he set to work ransacking the\ntumbled papers. Happily, Zimmerman had left all in confusion. The very\nhopelessness of his accounts proved a relief. Working at high tension,\nRudolph wrestled through disorder, mistakes, falsification; and little\nby little, as the sorted piles grew and his pen traveled faster, the old\nabsorbing love of method and dispatch--the stay, the cordial flagon of\ntroubled man--gave him strength to forget.\n\nAt times, felt shoes scuffed the stone floor without, and high, scolding\nvoices rose, exchanging unfathomable courtesy with his clerks. One after\nanother, strange figures, plump and portly in their  robes,\ncrossed his threshold, nodding their buttoned caps, clasping their hands\nhidden in voluminous sleeves.\n\n\"My 'long speakee my goo' flien',\" chanted each of these apparitions;\nand each, after a long, slow discourse that ended more darkly than it\nbegan, retired with fatuous nods and smirks of satisfaction, leaving\nRudolph dismayed by a sense of cryptic negotiation in which he had been\nfound wanting.\n\nNoon brought the only other interval, when two solemn \"boys\" stole in\nwith curry and beer. Eat he could not in this lazaret, but sipped a\nlittle of the dark Kirin brew, and plunged again into his researches.\nAlone with his lamp and rustling papers, he fought through perplexities,\nnow whispering, now silent, like a student rapt in some midnight fervor.\n\n\"What ho! Mustn't work this fashion!\" Heywood's voice woke him, sudden\nas a gust of sharp air. \"Makee finish!\"\n\nThe summons was both welcome and unwelcome; for as their chairs jostled\nhomeward through the reeking twilight, Rudolph felt the glow of work\nfade like the mockery of wine. The strange seizure returned,--exile,\ndanger, incomprehensibility, settled down upon him, cold and steady as\nthe rain. Tea, at Heywood's house, was followed by tobacco, tobacco by\nsherry, and this by a dinner from yesterday's game-bag. The two men said\nlittle, sitting dejected, as if by agreement. But when Heywood rose, he\nchanged into gayety as a man slips on a jacket.\n\n\"Now, then, for the masked ball! I mean, we can't carry these long\nfaces to the club, can we? Ladies' Night--what larks!\" He caught up his\ncap, with a grimace. \"The Lord loveth a cheerful liar. Come ahead!\"\n\nOn the way, he craned from his chair to shout, in the darkness:--\n\n\"I say! If you can do a turn of any sort, let the women have it. All the\nfun they get. Be an ass, like the rest of us. Maskee how silly! Mind\nyou, it's all hands, these concerts!\"\n\nNo music, but the click of ivory and murmur of voices came down the\nstairway of the club. At first glance, as Rudolph rose above the floor,\nthe gloomy white loft seemed vacant as ever; at second glance,\nembarrassingly full of Europeans. Four strangers grounded their cues\nlong enough to shake his hand. \"Mr. Nesbit,--Sturgeon--Herr\nKempner--Herr Teppich,\"--he bowed stiffly to each, ran the battery of\ntheir inspection, and found himself saluting three other persons at the\nend of the room, under a rosy, moon-bellied lantern. A gray matron,\nstout, and too tightly dressed for comfort, received him uneasily, a\ndark-eyed girl befriended him with a look and a quiet word, while a tall\nman, nodding a vigorous mop of silver hair, crushed his hand in a great\nbony fist.\n\n\"Mrs. Earle,\" Heywood was saying, \"Miss Drake, and--how are you,\npadre?--Dr. Earle.\"\n\n\"Good-evening,\" boomed the giant, in a deep and musical bass. \"We are\nvery glad, very glad.\" His voice vibrated through the room, without\neffort. It struck one with singular force, like the shrewd, kind\nbrightness of his eyes, light blue, and oddly benevolent, under brows\nhard as granite. \"Sit down, Mr. Hackh,\" he ordered genially, \"and give\nus news of the other world! I mean,\" he laughed, \"west of Suez.\nSmoking's allowed--here, try that!\"\n\nHe commanded them, as it were, to take their ease,--the women among\ncushions on a rattan couch, the men stretched in long chairs. He put\nquestions, indolent, friendly questions, opening vistas of reply and\nrecollection; so that Rudolph, answering, felt the first return of\nhomely comfort. A feeble return, however, and brief: in the pauses of\ntalk, misgiving swarmed in his mind, like the leaping vermin of last\nnight. The world into which he had been thrown still appeared\ndisorderly, incomprehensible, and dangerous. The plague--it still\nrecurred in his thoughts like a sombre motive; these friendly people\nwere still strangers; and for a moment now and then their talk, their\nsmiles, the click of billiards, the cool, commonplace behavior, seemed a\nfoolhardy unconcern, as of men smoking in a powder magazine.\n\n\"Clearing a bit, outside,\" called Nesbit. A little, wiry fellow, with\ncheerful Cockney speech, he stood chalking his cue at a window. \"I say,\nwhat's the matter one piecee picnic this week? Pink Pagoda, eh? Mrs.\nGilly's back, you know.\"\n\n\"No, is she?\" wheezed the fat Sturgeon, with something like enthusiasm.\n\"Now we'll brighten up! By Jove, that's good news. That's worth hearing.\nEh, Heywood?\"\n\n\"Rather!\" drawled Rudolph's friend, with an alacrity that seemed half\ncynical, half enigmatic.\n\nA quick tread mounted the stairs, and into the room rose Dr. Chantel. He\nbowed gracefully to the padre's group, but halted beside the players.\nWhatever he said, they forgot their game, and circled the table to\nlisten. He spoke earnestly, his hands fluttering in nervous gestures.\n\n\"Something's up,\" grumbled Heywood, \"when the doctor forgets to pose.\"\n\nBehind Chantel, as he wheeled, heaved the gray bullet-head and sturdy\nshoulders of Gilly.\n\n\"Alone?\" called the padre. \"Why, where's the Mem?\"\n\nHe came up with evident weariness, but replied cheerfully:--\n\n\"She's very sorry, and sent chin-chins all round. But to-night--Her\njourney, you know. She's resting.--I hope we've not delayed\nthe concert?\"\n\n\"Last man starts it!\" Heywood sprang up, flung open a battered piano,\nand dragged Chantel to the stool. \"Come, Gilly, your forfeit!\"\n\nThe elder man blushed, and coughed.\n\n\"Why, really,\" he stammered. \"Really, if you wish me to!\"\n\nHeywood slid back into his chair, grinning.\n\n\"Proud as an old peacock,\" he whispered to Rudolph. \"Peacock's voice,\ntoo.\"\n\nDr. Chantel struck a few jangling chords, and skipping adroitly over\nsick notes, ran a flourish. The billiard-players joined the circle, with\nabsent, serious faces. The singer cleared his throat, took on a\npreternatural solemnity, and began. In a dismal, gruff voice, he\nproclaimed himself a miner, deep, deep down:--\n\n\n\"And few, I trow, of my being know,\nAnd few that an atom care!\"\n\n\nHis hearers applauded this gloomy sentiment, till his cheeks flushed\nagain with honest satisfaction. But in the full sweep of a brilliant\ninterlude, Chantel suddenly broke down.\n\n\"I cannot,\" he declared sharply. As he turned on the squealing stool,\nthey saw his face white and strangely wrought. \"I had meant,\" he said,\nwith painful precision, \"to say nothing to-night, and act as--I cannot.\nJudge you, what I feel.\"\n\nHe got uncertainly to his feet, hesitating.\n\n\"Ladies, you will not be alarmed.\" The four players caught his eye, and\nnodded. \"It is well that you know. There is no danger here, more than--I\nam since disinfected. Monsieur Jolivet, my compatriot--You see, you\nunderstand. Yes, the plague.\"\n\nFor a space, the distant hum of the streets invaded the room. Then\nHeywood's book of music slapped the floor like a pistol-shot.\n\n\"You left him!\" He bounced from his chair, raging. \"You--Peng! Where's\nmy cap?\"\n\nQuick as he was, the dark-eyed girl stood blocking his way.\n\n\"Not you, Mr. Heywood,\" she said quietly. \"I must go stay with him.\"\n\nThey confronted each other, man and woman, as if for a combat of will.\nThe outbreak of voices was cut short; the whole company stood, like\nHomeric armies, watching two champions. Chantel, however, broke\nthe silence.\n\n\"Nobody must go.\" He eyed them all, gravely. \"I left him, yes. He does\nnot need any one. Personne. Very sudden. He went to the school sick this\nmorning. Swollen axillae--the poor fool, not to know!--et\npuis--enfin--He is dead.\"\n\nHeywood pitched his cap on the green field of the billiard-cloth.\n\n\"The poor pedagogue!\" he said bitterly. \"_He_ was going Home.\"\n\nSudden, hot and cold, like the thrust of a knife, it struck Rudolph that\nhe had heard the voice of this first victim,--the peevish voice which\ncried so weakly for a little silence, at early daylight, that very\nmorning. A little silence: and he had received the great.\n\nA gecko fell from the ceiling, with a tiny thump that made all start. He\nhad struck the piano, and the strings answered with a faint, aeolian\nconfusion. Then, as they regarded one another silently, a rustle, a\nflurry, sounded on the stairs. A woman stumbled into the loft, sobbing,\ncrying something inarticulate, as she ran blindly toward them, with\nwhite face and wild eyes. She halted abruptly, swayed as though to fall,\nand turned, rather by instinct than by vision, to the other women.\n\n\"Bertha!\" protested Gilly, with a helpless stare. \"My dear!\"\n\n\"I couldn't stay!\" she cried. \"The amah told me. Why did you ever let me\ncome back? Oh, do something--help me!\"\n\nThe face and the voice came to Rudolph like another trouble across a\ndream. He knew them, with a pang. This trembling, miserable heap, flung\ninto the arms of the dark-eyed girl, was Mrs. Forrester.\n\n\"Go on,\" said the girl, calmly. She had drawn the woman down beside her\non the rattan couch, and clasping her like a child, nodded toward the\npiano. \"Go on, as if the doctor hadn't--hadn't stopped.\"\n\nHeywood was first to obey.\n\n\"Come, Chantel, chantez! Here's your song.\" He took the stool in\nleap-frog fashion, and struck a droll simultaneous discord. \"Come on.--\nWell, then, catch me on the chorus!\"\n\n\n\"Pour qu' j' finisse\nMon service\nAu Tonkin je suis parti!\"\n\n\nTo a discreet set of verses, he rattled a bravado accompaniment.\nPresently Chantel moved to his side, and, with the same spirit, swung\ninto the chorus. The tumbled white figure on the couch clung to her\nrefuge, her bright hair shining below the girl's quiet, thoughtful face.\nShe was shaken with convulsive regularity.\n\nIn his riot of emotions, Rudolph found an over-mastering shame. A\npicture returned,--the Strait of Malacca, this woman in the blue\nmoonlight, a Mistress of Life, rejoicing, alluring,--who was now the\nsingle coward in the room. But was she? The question was quick and\nrevolting. As quickly, a choice of sides was forced on him. He\nunderstood these people, recalled Heywood's saying, and with that, some\nstory of a regiment which lay waiting in the open, and sang while the\nbullets picked and chose. All together: as now these half-dozen men\nwere roaring cheerfully:--\n\n\n\"Ma Tonkiki, ma Tonkiki, ma Tonkinoise,\nYen a d'autr's qui m' font les doux yeux,\nMais c'est ell' que j'aim' le mieux!\"\n\n\nThe new recruit joined them, awkwardly.\n\n\n\nCHAPTER IV\n\n\nTHE SWORD-PEN\n\n\"Wutzler was missing last night,\" said Heywood, lazily. He had finished\nbreakfast, and lighted a short, fat, glossy pipe. \"Just occurred to me.\nWe must have a look in on him. Poor old Wutz, he's getting worse and\nworse. Chantel's right, I fancy: it's the native wife.\" He rose, with a\nshort laugh. \"Queer. The rest never feel so,--Nesbit, and Sturgeon, and\nthat lot. But then, they don't fall so low as to marry theirs.\"\n\n\"By the way,\" he sneered, on the landing, \"until this scare blows over,\nyou'd better postpone any such establishment, if you intend--\"\n\n\"I do not,\" stammered Rudolph.\n\nTo his amazement, the other clapped him on the shoulder.\n\n\"I say!\" The sallow face and cynical gray eyes lighted, for the first\ntime, with something like enthusiasm. Next moment they had darkened\nagain, but not before he had said gruffly, \"You're not a bad\nlittle chap.\"\n\nMorosely, as if ashamed of this outburst, he led the way through the\nbare, sunny compound, and when the gate had closed rattling behind\nthem, stated their plans concisely and sourly. \"No work to-day, not a\nstroke! We'll just make it a holiday, catchee good time.--What? No. Rot!\nI won't work, and you can't. That's all there is about that. Don't be an\nass! Come along. We'll go out first and see Captain Kneebone.\" And when\nRudolph, faithful to certain tradesmen snoring in Bremen, would have\nprotested mildly, he let fly a stinging retort, and did not regain his\ntemper until they had passed the outskirts of the village. Yet even the\nquarrel seemed part of some better understanding, some new, subtle bond\nbetween two lonely men.\n\nBefore them opened a broad field dotted with curious white disks, like\nbone buttons thrown on a green carpet. Near at hand, coolies trotted and\nstooped, laying out more of these circular baskets, filled with tiny\ndough-balls. Makers of rice-wine, said Heywood; as he strode along\nexplaining, he threw off his surly fit. The brilliant sunlight, the\nbreeze stirring toward them from a background of drooping bamboos, the\ngabble of coolies, the faint aroma of the fermenting _no-me_ cakes,\nbegan, after all, to give a truant sense of holiday.\n\nAlmost gayly, the companions threaded a marshy path to the river, and\nbargained with a shrewd, plump woman who squatted in the bow of a\nsampan. She chaffered angrily, then laughed at some unknown saying of\nHeywood's, and let them come aboard. Summoned by voluble scolding, her\nhusband appeared, and placidly labored at the creaking sweep. They\nslipped down a river of bronze, between the oozy banks; and the\nwar-junks, the naked fisherman, the green-coated ruins of forts, drifted\npast like things in reverie, while the men lay smoking, basking in\nbright weather. They looked up into serene spaces, and forgot the umbra\nof pestilence.\n\nHeywood, now lazy, now animated, exchanged barbaric words with the\nboat-woman. As their tones rose and fell, she laughed. Long afterward,\nRudolph was to remember her, a wholesome, capable figure in faded blue,\ndarting keen glances from her beady eyes, flashing her white teeth in a\nsmile, or laughing till the green pendants of false jade trembled in\nher ears.\n\n\"Her name is Mrs. Wu,\" said Heywood, between smoke-rings, \"and she is a\nlady of humor. We are discussing the latest lawsuit, which she describes\nas suing a flea and winning the bite. Her maiden name was the Pretty\nLily. She is captain of this sampan, and fears that her husband does not\nrate A. B.\"\n\nWhere the river disembogued, the Pretty Lily, cursing and shrilling,\npattering barefoot about her craft, set a matting sail and caught the\nbreeze. Over the copper surface of the roadstead, the sampan drew out\nhandily. Ahead, a black, disreputable little steamer lay anchored, her\nname--two enormous hieroglyphics painted amidships--staring a bilious\nyellow in the morning sun. Under these, at last, the sampan came\nbumping, unperceived or neglected.\n\nOverhead, a pair of white shoes protruded from the rail in a blue film\nof smoke. They twitched, as a dry cackle of laughter broke out.\n\n\"Kut Sing, ahoy!\" shouted Heywood. \"On deck! Kneebone!\"\n\nThe shoes whipped inboard. Outboard popped a ruddy little face, set in\nthe green circle of a _topi_, and contorted with laughter.\n\n\"Listen to this, will ye!\" cried the apparition, as though illustrating\na point. Leaning his white sleeves on the rail, cigar in one fist,\nTauchnitz volume in the other, he roared down over the side a passage of\nprose, from which his visitors caught only the words \"Ginger Dick\" and\n\"Peter Russet,\" before mirth strangled him.\n\n\"God bless a man,\" he cried, choking, \"that can make a lonesome old\nbeggar laugh, out here! Eh, what? How he ever thinks up--But he's took\nto writing plays, they tell me. Plays!\" He scowled ferociously. \"Fat lot\no' good they are, for skippers, and planters, and gory exiles! Eh, what?\nBe-george, I'll write him a chit! _I'll_ tell him! Plays be damned; we\nwant more stories!\"\n\nRed and savage, he hurled the book fluttering into the sea, then swore\nin consternation.\n\n\"Oh, I say!\" he wailed. \"Fish her out! I've not finished her. My\nintention was, ye know, to fling the bloomin' cigar!\"\n\nHeywood, laughing, rescued the volume on a long bamboo.\n\n\"Just came out on the look-see, captain,\" he called up. \"Can't board\nyou. Plague ashore.\"\n\n\"Plague be 'anged!\" scoffed the little captain. \"That hole's no worse\nwith plague than't is without. Got two cases on board, myself--coolies.\nStowed 'em topside, under the boats.--Come up here, ye castaway! Come\nup, ye goatskin Robinson Crusoe, and get a white man's chow!\"\n\nHe received them on deck,--a red, peppery little officer, whose shaven\ncheeks and close gray hair gave him the look of a parson gone wrong, a\nhedge-priest run away to sea. Two tall Chinese boys scurried about with\nwicker chairs, with trays of bottles, ice, and cheroots, while he barked\nhis orders, like a fox-terrier commanding a pair of solemn dock-rats.\nThe white men soon lounged beside the wheel-house.\n\n\"So you brought Mrs. Forrester,\" drawled Heywood.\n\nRudolph, wondering if they saw him wince, listened with painful\neagerness. But the captain disposed of that subject very simply.\n\n\"_She's_ no good.\" He stared up at the grimy awning. \"What I'm thinking\nis, will that there Dacca babu at Koprah slip me through his blessed\nquarantine for twenty-five dollars. What?\"\n\nTheir talk drifted far away from Rudolph, far from China itself, to\ntouch a hundred ports and islands, Cebu and Sourabaya, Tavoy and\nSelangor. They talked of men and women, a death at Zamboanga, a birth at\nChittagong, of obscure heroism or suicide, and fortunes made or lost;\nwhile the two boys, gentle, melancholy, gliding silent in bright blue\nrobes, spread a white tablecloth, clamped it with shining brass, and\nlaid the tiffin. Then the talk flowed on, the feast made a tiny clatter\nof jollity in the slumbering noon, in the silence of an ocean and a\ncontinent. And when at last the visitors clambered down the iron side,\nthey went victorious with Spanish wine.\n\n\"Mind ye,\" shouted Captain Kneebone, from the rail, \"that don't half\nexhaust the subjeck o' lott'ries! Why, luck\"--He shook both fists aloft,\ntriumphantly, as if they had been full of money. \"Just ye wait. I've a\ntip from Calcutta that--Never mind. Bar sells, when that fortch'n comes,\nmy boy, the half's yours! Home we go, remember that!\"\n\nThe sampan drew away. Sweeping his arm violently, to threaten the coast\nof China and the whole range of his vision,--\n\n\"You're the one man,\" he roared, \"that makes all this mess--worth a\ncowrie!\"\n\nHeywood laughed, waved his helmet, and when at last he turned, sat\nlooking downward with a queer smile.\n\n\"Illusions!\" he chuckled. \"What would a chap ever do without 'em? Old\nKneebone there: his was always that--a fortune in a lottery, and then\nHome! Illusions! And he's no fool, either. Good navigator. Decent old\nbeggar.\" He waved his helmet again, before stretching out to sleep. \"Do\nyou know, I believe--he _would_ take me.\"\n\nThe clinkered hills, quivering in the west, sank gradually into the\nheated blur above the plains. As gradually, the two men sank\ninto dreams.\n\nFurious, metallic cries from the Pretty Lily woke them, in the blue\ntwilight. She had moored her sampan alongside a flight of stone steps,\nup which, vigorously, with a bamboo, she now prodded her husband. He\ncontended, snarling, but mounted; and when Heywood's silver fell\njingling into her palm, lighted his lantern and scuffed along, a\nchurlish guide. At the head of the slimy stairs, Heywood rattled a\nponderous gate in a wall, and shouted. Some one came running, shot\nbolts, and swung the door inward. The lantern showed the tawny, grinning\nface of a servant, as they passed into a small garden, of dwarf orange\ntrees pent in by a lofty, whitewashed wall.\n\n\"These grounds are yours, Hackh,\" said Heywood. \"Your predecessor's boy;\nand there\"--pointing to a lonely barrack that loomed white over the\nstunted grove--\"there's your house. You draw the largest in the station.\nA Portuguese nunnery, it was, built years ago. My boys are helping set\nit to rights; but if you don't mind, I'd like you to stay on at my\nbeastly hut until this--this business takes a turn. Plenty of time.\" He\nnodded at the fat little orange trees. \"We may live to take our chow\nunder those yet, of an evening. Also a drink. Eh?\"\n\nThe lantern skipped before them across the garden, through a penitential\ncourtyard, and under a vaulted way to the main door and the road. With\nRudolph, the obscure garden and echoing house left a sense of magical\nownership, sudden and fleeting, like riches in the Arabian Nights. The\nroad, leaving on the right a low hill, or convex field, that heaved\nagainst the lower stars, now led the wanderers down a lane of hovels,\namong dim squares of smoky lamplight.\n\nWu, their lantern-bearer, had turned back, and they had begun to pass a\nfew quiet, expectant shops, when a screaming voice, ahead, outraged the\nevening stillness.\n\nAt the first words, Heywood doubled his pace.\n\n\"Come along. Here's a lark--or a tragedy.\"\n\nJostling through a malodorous crowd that blockaded the quarrel, they\ngained the threshold of a lighted shop. Against a rank of orderly\nshelves, a fat merchant stood at bay, silent, quick-eyed, apprehensive.\nBefore him, like an actor in a mad scene, a sobbing ruffian, naked to\nthe waist, convulsed with passion, brandished wild fists and ranted with\nincredible sounds. When breath failed, he staggered, gasping, and swept\nhis audience with the glazed, unmeaning stare of drink or lunacy. The\nmerchant spoke up, timid and deprecating. As though the words were\nvitriol, the other started, whirled face to face, and was seized with a\nnew raving.\n\nSomething protruded at his waistband, like a rudimentary, Darwinian\nstump. To this, all at once, his hand flung back. With a wrench and a\nglitter, he flourished a blade above his head. Heywood sprang to\nintervene, in the same instant that the disturber of trade swept his arm\ndown in frenzy. Against his own body, hilt and fist thumped home, with\nthe sound as of a football lightly punted. He turned, with a freezing\nlook of surprise, plucked at the haft, made one step calmly and\ntentatively toward the door, stumbled, and lay retching and coughing.\n\nThe fat shop-keeper wailed like a man beside himself. He gabbled,\nimploring Heywood. The young man nodded. \"Yes, yes,\" he repeated\nirritably, staring down at the body, but listening to the stream\nof words.\n\nMurmurs had risen, among the goblin faces blinking in the doorway.\nBehind them, a sudden voice called out two words which were caught up\nand echoed harshly in the street. Heywood whipped about.\n\n\"Never called me that before,\" he said quickly. \"Come outside.\"\n\nHe flung back a hurried sentence to the merchant, caught Rudolph's arm,\nand plunged into the crowd. The yellow men gave passage mechanically,\nbut with lowering faces. Once free in the muddy path, he halted quickly,\nand looked about.\n\n\"Might have known,\" he grumbled. \"Never called me 'Foreign Dog' before,\nor 'Jesus man,' He set 'em on.\"\n\nRudolph followed his look. In the dim light, at the outskirts of the\nrabble, a man was turning away, with an air of contempt or unconcern.\nThe long, pale, oval face, the hard eyes gleaming with thought, had\nvanished at a glance. A tall, slight figure, stooping in his long robe,\nhe glided into the darkness. For all his haste, the gait was not the\ngait of a coolie.\n\n\"That,\" said Heywood, turning into their former path, \"that was Fang,\nthe Sword-Pen, so-called. Very clever chap. Of the two most dangerous\nmen in the district, he's one.\" They had swung along briskly for several\nminutes, before he added: \"The other most dangerous man--you've met him\nalready. If I'm not mistaken, he's no less a person than the Reverend\nJames Earle.\"\n\n\"What!\" exclaimed Rudolph, in dull bewilderment.\n\n\"Yes,\" grunted his friend. \"The padre. We must find him to-night, and\nreport.\"\n\nHe strode forward, with no more comment. At his side, Rudolph moved as a\nsoldier, carried onward by pressure and automatic rhythm, moves in the\napathy of a forced march. The day had been so real, so wholesome, full\nof careless talk and of sunlight. And now this senseless picture blotted\nall else, and remained,--each outline sharper in memory, the smoky lamp\nbrighter, the blow of the hilt louder, the smell of peanut oil more\npungent. The episode, to him, was a disconnected, unnecessary fragment,\none bloody strand in the whole terrifying snarl. But his companion\nstalked on in silence, like a man who saw a pattern in the web of\nthings, and was not pleased.\n\n\n\nCHAPTER V\n\n\nIN TOWN\n\nNight, in that maze of alleys, was but a more sinister day. The same\nslant-eyed men, in broken files, went scuffing over filthy stone, like\nwanderers lost in a tunnel. The same inexplicable noises endured, the\nsame smells. Under lamps, the shaven foreheads still bent toward\nmicroscopic labor. The curtained window of a fantan shop still glowed in\norange translucency, and from behind it came the murmur and the endless\nchinking of cash, where Fortune, a bedraggled, trade-fallen goddess,\nsplit hairs with coolies for poverty or zero. Nothing was altered in\nthese teeming galleries, except that turbid daylight had imperceptibly\ngiven place to this other dimness, in which lanterns swung like tethered\nfire-balloons. Life went on, mysteriously, without change or sleep.\n\nWhile the two white men shouldered their way along, a strange chorus\nbroke out, as though from among the crowded carcasses in a butcher's\nstall. Shrill voices rose in unearthly discord, but the rhythm was\nnot of Asia.\n\n\"There goes the hymn!\" scoffed Heywood. He halted where, between the\nbutcher's and a book-shop, the song poured loud through an open doorway.\nNodding at a placard, he added: \"Here we are: 'Jesus Religion Chapel.'\nHear 'em yanging! 'There is a gate that stands ajar.' That being the\ncase, in you go!\"\n\nEntering a long, narrow room, lighted from sconces at either side, they\nsat down together, like schoolmates, on a low form near the door. From a\ndais across at the further end, the vigorous white head of Dr. Earle\ndominated the company,--a strange company, of lounging Chinamen who\nsucked at enormous bamboo pipes, or squinted aimlessly at the vertical\ninscriptions on the walls, or wriggling about, stared at the\nlate-comers, nudged their neighbors, and pointed, with guttural\nexclamations. The song had ended, and the padre was lifting up his\ngiant's voice. To Rudolph, the words had been mere sound and fury, but\nfor a compelling honesty that needed no translation. This man was not\npreaching to heathen, but talking to men. His eyes had the look of one\nwho speaks earnestly of matters close at hand, direct, and simple. Along\nthe forms, another and another man forgot to plait his queue, or squirm,\nor suck laboriously at his pipe. They listened, stupid or intent. When\nsome waif from the outer labyrinth scuffed in, affable, impudent,\nhailing his friends across the room, he made but a ripple of unrest,\nand sank gaping among the others like a fish in a pool.\n\nEven Heywood sat listening--with more attention than respect, for once\nhe muttered, \"Rot!\" Toward the close, however, he leaned across and\nwhispered, \"The old boy reels it off rather well to-night. Different to\nwhat one imagined.\"\n\nRudolph, for his part, sat watching and listening, surprised by a new\nand curious thought.\n\nA band of huddled converts sang once more, in squealing discords, with\nan air of sad, compulsory, and diabolic sarcasm. A few \"inquirers\"\nslouched forward, and surrounding the tall preacher, questioned him\nconcerning the new faith. The last, a broad, misshapen fellow with\nhanging jowls, was answered sharply. He stood arguing, received another\nsnub, and went out bawling and threatening, with the contorted face and\nclumsy flourishes of some fabulous hero on a screen.\n\nThe missionary approached smiling, but like a man who has finished the\nday's work.\n\n\"That fellow--Good-evening: and welcome to our Street Chapel, Mr.\nHackh--That fellow,\" he glanced after the retreating figure, \"he's a\nlesson in perseverance, gentlemen. A merchant, well-to-do: he has a\nlawsuit coming on--notorious--and tries to join us for protection.\nCheaper to buy a little belief, you know, than to pay Yamen fines.\nEvery night he turns up, grinning and bland. I tell him it won't do, and\nout he goes, snorting like a dragon.\"\n\nRudolph's impulse came to a head.\n\n\"Dr. Earle,\" he stammered, \"I owe you a gratitude. You spoke to these\npeople so--as--I do not know. But I listened, I felt--Before always are\nthey devils, images! And after I hear you, they are as men.\"\n\nThe other shook his great head like a silver mane, and laughed.\n\n\"My dear young man,\" he replied, \"they're remarkably like you and me.\"\n\nAfter a pause, he added soberly:--\n\n\"Images? Yes, you're right, sir. So was Adam. The same clay, the same\nimage.\" His deep voice altered, his eyes lighted shrewdly, as he turned\nto Heywood. \"This is an unexpected pleasure.\"\n\n\"Quite,\" said the young man, readily. \"If you don't mind, padre, you\nmade Number One talk. Fast bowling, and no wides. But we really came for\nsomething else.\" In a few brief sentences, he pictured the death in the\nshop.--So, like winking! The beggar gave himself the iron, fell down,\nand made finish. Now what I pieced out, from his own bukhing, and the\nmerchant's, was this:--\n\n\"The dead man was one Au-yoeng, a cormorant-fisher. Some of his best\nbirds died, he had a long run of bad luck, and came near starving. So he\ncontrived, rather cleverly, to steal about a hundred catties of Fuh-kien\nhemp. The owner, this merchant, went to the elders of Au-yoeng's\nneighborhood, who found and restored the hemp, nearly all. Merchant lets\nthe matter drop. But the neighbors kept after this cormorant fellow,\nworked one beastly squeeze or another, ingenious baiting, devilish--Rot!\nyou know their neighborhoods better than I! Well, they pushed him\ndown-hill--poor devil, showing that's always possible, no bottom! He\nbrooded, and all that, till he thought the merchant and the Jesus\nreligion were the cause of all. So bang he goes down the\npole,--gloriously drunk,--marches into his enemy's shop, and uses that\nknife. The joke is now on the merchant, eh?\"\n\n\"Just a moment,\" begged the padre. \"One thread I don't follow--the\nreligion. Who was Christian? The merchant?\"\n\n\"Well, rather! Thought I told you,\" said Heywood. \"One of yours--big,\nmild chap--Chok Chung.\"\n\nThe elder man sat musing.\n\n\"Yes,\" the deep bass rumbled in the empty chapel, \"he's one of us.\nExtremely honest. I'm--I'm very sorry. There may be trouble.\"\n\n\"Must be, sir,\" prompted the younger. \"The mob, meanwhile, just stood\nthere, dumb,--mutes and audience, you know. All at once, the hindmost\nbegan squalling 'Foreign Dog,' 'Goat Man.' We stepped outside, and\nthere, passing, if you like, was that gentle bookworm, Mr. Fang.\"\n\n\"Fang?\" echoed the padre, as in doubt. \"I've heard the name.\"\n\n\"Heard? Why, doctor,\" cried Heywood, \"that long, pale chap,--lives over\ntoward the Dragon Spring. Confucian, very strict; keen reader; might be\na mandarin, but prefers the country gentleman sort; bally\nmischief-maker, he's done more people in the eye than all the Yamen\nhacks and all their false witnesses together! Hence his nickname--the\nSword-Pen.\"\n\nDr. Earle sharpened his heavy brows, and studied the floor.\n\n\"Fang, the Sword-Pen,\" he growled; \"yes, there will be trouble. He hates\nus. Given this chance--Humph! Saul of Tarsus.--We're not the Roman\nChurch,\" he added, with his first trace of irritation. \"Always\noccurring, this thing.\"\n\nOnce more he meditated; then heaved his big shoulders to let slip the\nwhole burden.\n\n\"One day at a time,\" he laughed. \"Thank you for telling us.--You see,\nMr. Hackh, they're not devils. The only fault is, they're just human\nbeings. You don't speak the language? I'll send you my old teacher.\"\n\nThey talked of things indifferent; and when the young men were stumbling\nalong the streets, he called after them a resounding \"Good-night!\nThanks!\"--and stood a resolute, gigantic silhouette, filling, as a right\nDoone filled their doorframe, the entrance to his deserted chapel.\n\nAt his gate, felt Rudolph, they had unloaded some weight of\nresponsibility. He had not only accepted it, but lightened them further,\ngirt them, by a word and a look. Somehow, for the first time since\nlanding, Rudolph perceived that through this difficult, troubled,\nignorant present, a man might burrow toward a future gleam. The feeling\nwas but momentary. As for Heywood, he still marched on grimly, threading\nthe stuffed corridors like a man with a purpose.\n\n\"No dinner!\" he snapped. \"Catchee bymby, though. We must see Wutzler\nfirst. To lose sight of any man for twenty-four hours, nowadays,--Well,\nit's not hardly fair. Is it?\"\n\nThey turned down a black lane, carpeted with dry rubbish. At long\nintervals, a lantern guttering above a door showed them a hand's-breadth\nof the dirty path, a litter of broken withes and basket-weavers' refuse,\nbetween the mouldy wall of the town and a row of huts, no less black and\nsilent. In this greasy rift the air lay thick, as though smeared into\na groove.\n\nSuddenly, among the hovels, they groped along a checkered surface of\nbrick-work. The flare of Heywood's match revealed a heavy wooden door,\nwhich he hammered with his fist. After a time, a disgruntled voice\nwithin snarled something in the vernacular. Heywood laughed.\n\n\"Ai-yah! Who's afraid? Wutzler, you old pirate, open up!\"\n\nA bar clattered down, the door swung back, and there, raising a\nglow-worm lantern of oiled paper, stood such a timorous little figure as\nmight have ventured out from a masquerade of gnomes. The wrinkled face\nwas Wutzler's, but his weazened body was lost in the glossy black folds\nof a native jacket, and below the patched trousers, his bare ankles and\ncoolie-sandals of straw moved uneasily, as though trying to hide behind\neach other.\n\n\"Kom in,\" said this hybrid, with a nervous cackle. \"I thought you are\nthiefs. Kom in.\"\n\nFollowing through a toy courtyard, among shadow hints of pigmy shrubs\nand rockery, they found themselves cramped in a bare, clean cell,\nlighted by a European lamp, but smelling of soy and Asiatics. Stiff\nblack-wood chairs lined the walls. A distorted landscape on rice-paper,\nnarrow scarlet panels inscribed with black cursive characters, pith\nflowers from Amoy, made blots of brightness.\n\n\"It iss not moch, gentlemen,\" sighed Wutzler, cringing. \"But I am ver'\nglad.\"\n\nHeywood flung himself into a chair.\n\n\"Not dead yet, you rascal?\" he cried. \"And we came all the way to see\nyou. No chow, either.\"\n\n\"Oh, allow me,\" mumbled their host, in a flutter. \"My--she--I will\nspeak, I go bring you.\" He shuffled away, into some further chamber.\n\nHeywood leaned forward quickly.\n\n\"Eat it,\" he whispered, \"whether you can or not! Pleases the old one, no\nbounds. We're his only visitors--\"\n\n\"Here iss not moch whiskey.\" Wutzler came shambling in, held a bottle\nagainst the light, and squinted ruefully at the yellow dregs. \"I will\ngif you a _kong_ full, but I haf not.\"\n\nHe dodged out again. They heard his angry whispers, and a small\ncommotion of the household,--brazen dishes clinking, squeals, titters,\nand tiny bare feet skipping about,--all the flurry of a rabbit-hutch in\nWonderland. Once, near the threshold, a chubby face, very pale, with\nround eyes of shining jet, peered cautious as a mouse, and popped out of\nsight with a squeak. Wutzler, red with excitement, came and went like an\nanxious waiter, bringing in the feast.\n\n\"Here iss not moch,\" he repeated sadly. But there were bits of pig-skin\nstewed in oil; bean-cakes; steaming buns of wheat-flour, stuffed with\ndice of fat pork and lumps of sugar; three-cornered rice puddings,\n_no-me_ boiled in plantain-leaf wrappers; with the last of the whiskey,\nin green cups. While the two men ate, the shriveled outcast beamed\ntimidly, hovering about them, fidgeting.\n\n\"Herr Hackh,\" he suddenly exclaimed, in a queer, strained voice, \"you do\nnot know how dis yong man iss goot! No! He hass to me--_immer_--\" He\nchoked, turned away, and began fussing with the pith flowers; but not\nbefore Rudolph had seen a line glistening down the sun-dried cheeks.\n\n\"Stuff! Cadging for chow, does one acquire merit?\" retorted Heywood,\nover his shoulder. \"You talk like a bonze, Wutz.\" He winked. \"I'd rather\nhear the sing-song box.\"\n\n\"_Ach so_, I forget!\" Still whimpering, Wutzler dragged something from a\ncorner, squatted, and jerked at a crank, with a noise of ratchets. \"She\nblay not so moch now,\" he snuffled. \"Captain Kneepone he has gifen her,\nwhen she iss all op inside for him. I haf rebaired, but she blay only\none song yet. A man does not know, Herr Hackh, what he may be. Once I\nhaf piano, and viola my own, yes, and now haf I diss small, laffing,\nsick teufel!\" He rose, and faced Heywood with a trembling, passionate\ngesture. \"But diss yong man, he stand by der oldt fellow!\" The streaming\neyes blinked absurdly.\n\nBehind him, with a whirring sound, a metallic voice assailed them in a\ngabble of words, at first husky and broken, then clear, nasal, a voice\nfrom neither Europe nor Asia, but America:--\n\n\n\"Then did I laff?\nOoh, aha-ha ha ha,\nHa, ha, ha, ha, ha!\nI could not help but laffing,\nOoh, aha-ha ...\"\n\n\nFrom a throat of tin, it mocked them insanely with squealing,\nblack-hearted guffaws. Heywood sat smoking, with the countenance of a\nstoic; but when the laughter in the box was silent, he started abruptly.\n\n\"We're off, old chap,\" he announced. \"Bedtime. Just came to see you were\nall up-standing. Tough as ever? Good! Don't let--er--anything carry\nyou off.\"\n\nAt the gate, Wutzler held aloft his glow-worm lantern.\n\n\"Dose fellows catch me?\" he mumbled, \"Der plagues--dey will forget me.\nAll zo many shoots, _kugel_, der bullet,--'_gilt's mir, oder gilt es\ndir?_' Men are dead in der Silk-Weafer Street. Dey haf hong up nets, and\ndorns, to keep out der plague's-goblins off deir house. Listen, now, dey\nbeat gongs!--But we are white men. You--you tell me zo, to-night!\" He\nblubbered something incoherent, but as the gate slammed they heard the\nname of God, in a broken benediction.\n\nThey had groped out of the cleft, and into a main corridor, before\nHeywood paused.\n\n\"That devil in the box!\" He shook himself like a spaniel. \"Queer it\nshould get into me so. But I hate being laughed at by--anybody.\"\n\nA confused thunder of gongs, the clash of cymbals smothered in the\ndistance, maintained a throbbing uproar, pierced now and then by savage\nyells, prolonged and melancholy. As the two wanderers listened,--\n\n\"Where's the comfort,\" said Heywood, gloomily, \"of knowing somebody's\nworse off?--No, I wasn't thinking of Wutzler, then. Talk of germs! why,\nover there, it's goblins they're scaring away. Think, behind their nets\nand thorns, what wretches--women, too, and kids--may be crouched down,\nquaking, sick with terror. Humph!--I don't mind saying\"--for a moment\nhis hand lay on Rudolph's shoulder--\"that I loathe giving this muck-hole\nthe satisfaction--I'd hate to go Out here, that's all.\"\n\n\n\nCHAPTER VI\n\n\nTHE PAGODA\n\nHe was spared that inconvenience. The untimely rain and cold, some\npersons said, the few days of untimely heat following, had drowned or\ndried, frozen or burnt out, the seeds of peril. But accounts varied,\nreasons were plentiful. Soldiers had come down from the chow city,\ntwo-score _li_ inland, and charging through the streets, hacking and\nslashing the infested air, had driven the goblins over the walls, with a\ngreat shout of victory. A priest had freighted a kite with all the evil,\nthen cut it adrift in the sky. A mob had dethroned the God of Sickness,\nand banished his effigy in a paper junk, launched on the river at night,\nin flame. A geomancer proclaimed that a bamboo grove behind the town\nformed an angle most correct, germane, and pleasant to the Azure Dragon\nand the White Tiger, whose occult currents, male and female, run\nthroughout Nature. For any or all of these reasons, the town was\ndelivered. The pestilence vanished, as though it had come but to grant\nMonsieur Jolivet his silence, and to add a few score uncounted living\nwretches to the dark, mighty, imponderable host of ancestors.\n\nThe relief, after dragging days of uncertainty, came to Rudolph like a\nsea-breeze to a stoker. To escape and survive,--the bare experience\nseemed to him at first an act of merit, the deed of a veteran. The\ninterim had been packed with incongruity. There had been a dinner with\nKempner, solemn, full of patriotism and philosophy; a drunken dinner at\nTeppich's; another, and a worse, at Nesbit's; and the banquet of a\nnative merchant, which began at four o'clock on melon-seeds, tea, black\nyearling eggs, and a hot towel, and ended at three in the morning on\nrice-brandy and betel served by unreal women with chalked faces and\nvermilion-spotted lips, simpering and melancholy. By day, there was\nwork, or now and then a lesson with Dr. Earle's teacher, a little aged\nChinaman of intricate, refined, and plaintive courtesy. Under his\nguidance Rudolph learned rapidly, taking to study as a prodigal might\ntake to drink. And with increasing knowledge came increasing\ntranquillity; as when he found that the hideous cry, startling him at\nevery dawn, was the signal not for massacre, but buffalo-milk.\n\nThen, too, came the mild excitement of moving into his own house, the\nPortuguese nunnery. Through its desolate, lime-coated spaces, his meagre\nbelongings were scattered all too easily; but the new servants, their\nwords and ways, not only kept his hands full, but gave strange food for\nthought. The silent evenings, timed by the plash of a frog in a pool, a\ncry from the river, or the sing-song of a \"boy\" improvising some endless\nballad below-stairs; drowsy noons above the little courtyard, bare and\npeaceful as a jail; homesick moments at the window, when beyond the\nstunted orangery, at sunset, the river was struck amazingly from bronze\nto indigo, or at dawn flashed from pearl-gray to flowing brass;--all\nthese, and nights between sleep and waking, when fancy peopled the\nechoing chambers with the visionary lives, now ended, of meek, brown\nsisters from Goa or Macao, gave to Rudolph intimations, vague, profound,\nand gravely happy, as of some former existence almost recaptured. Once\nmore he felt himself a householder in the Arabian tales.\n\nAnd yet, when his life was growing all but placid, across it shot some\ntremor of disquieting knowledge.\n\nOne evening, after a busy day among his piece-goods, he had walked\nafield with Heywood, and back by an aimless circuit through the\ntwilight. His companion had been taciturn, of late; and they halted,\nwithout speaking, where a wide pool gleamed toward a black, fantastic\nbelt of knotted willows and sharp-curving roofs. Through these broke the\nshadow of a small pagoda, jagged as a war-club of shark's teeth. Vesper\ncymbals clashed faintly in a temple, and from its open door the first\nplummet of lamplight began to fathom the dark margin. A short bridge\ncurved high, like a camel's hump, over the glimmering half-circle of a\nsingle arch. Close by, under a drooping foreground of branches, a stake\nupheld an oblong placard of neat symbols, like a cartouche to explain\na painting.\n\n\"It is very beautiful,\" ventured Rudolph, twisting up his blond\nmoustache with satisfaction. \"Very sightly. I would say--picturesque, no?\"\n\n\"Very,\" said Heywood, absently. \"Willow Pattern.\"\n\n\"And the placard, so finishing, so artistic--That says?\"\n\n\"Eh, what? Oh, I wasn't listening.\" Heywood glanced carelessly at the\nupright sentence. That's a notice:--\n\n\"'Girls May Not be Drowned in This Pond.'\"\n\nHe started on, without comment. Without reply, Rudolph followed,\ngathering as he walked the force of this tremendous hint. Slow,\nfar-reaching, it poisoned the elegiac beauty of the scene, alienated the\nnight, and gave to the fading country-side a yet more ancient look,\nsombre and implacable. He was still pondering this, when across their\nwinding foot-path, with a quick thud of hoofs, swept a pair of\nequestrian silhouettes. It was half glimpse, half conjecture,--the tough\nlittle ponies trotting stubbornly, a rider who leaned across laughing,\nand a woman who gayly cried at him: \"You really do understand me, don't\nyou?\" The two jogging shadows melted in the bamboo tracery, like things\nblown down the wind. But for years Rudolph had known the words, the\nlaugh, the beguiling cadence, and could have told what poise of the head\nwent with them, what dangerous glancing light. Suddenly, without reason,\nhe felt a gust of rage. It was he that understood. It was to him these\nthings belonged. The memory of her weakness was lost in the shining\nmemory of her power. He should be riding there, in the dusk of this\nlonely and cruel land.\n\nHeywood had thrown after them a single gloomy stare, down the pointed\naisle of bamboos.\n\n\"Well matched!\" he growled. \"Chantel--He bounds in the saddle, and he\nbounds afoot!\"\n\nRudolph knew that he had hated Chantel at sight.\n\nHe could not bring himself, next day, to join their party for tiffin at\nthe Flowery Pagoda. But in the midst of his brooding, Teppich and the\nfat Sturgeon assailed the nunnery gate with pot-valiant blows and\nshouts. They had brought chairs, to carry him off; and being in no mood\nto fail, though panting and struggling, they packed him into a\npalanquin with many bottles of the best wine known to Fliegelman and\nSons. By a short cut through the streets--where checkered sunshine,\nthrough the lattice roof, gave a muddy, subdued light as in a roiled\naquarium--the revelers passed the inland wall. Here, in the shade,\ngrooms awaited them with ponies; and scrambling into saddle, they\ntrotted off through gaps in the bamboos, across a softly rolling\ncountry. Tortuous foot-paths of vivid pink wound over brilliant green\nterraces of young paddy. The pink crescents of new graves scarred the\nhillsides, already scalloped and crinkled with shelving abodes of the\nvenerable dead. Great hats of farmers stooping in the fields, gleamed in\nthe sun like shields of brass. Over knolls and through hollows the\nlittle cavalcade jogged steadily, till, mounting a gentle eminence, they\nwound through a grove of camphor and Flame-of-the-Forest. Above the\nbranches rose the faded lilac shaft of an ancient pagoda, ruinously\nadorned with young trees and wild shrubs clinging in the cornices.\n\nAt the foot of this aged fantasy in stone, people were laughing. The\nthree riders broke cover in time to see Mrs. Forrester, flushed and\nradiant, end some narrative with a droll pantomime. She stood laughing,\nthe life and centre of a delighted group.\n\n\"And Gilbert Forrester,\" she cried, turning archly on her husband,\n\"said that wasn't funny!\"\n\nGilly tugged his gray moustache, in high good-nature. Chantel, Nesbit,\nand Kempner laughed uproariously, the padre and the dark-eyed Miss Drake\nquietly, Heywood more quietly, while even stout, uneasy Mrs. Earle\nsmiled as in duty bound. A squad of Chinese boys, busy with\ntiffin-baskets, found time to grin. To this lively actress in the white\ngown they formed a sylvan audience under the gnarled boughs and\nthe pagoda.\n\n\"Too late!\" called the white-haired giant, indulgently, to the\ndismounting trio. \"Mr. Hackh, you should have come spurring.\"\n\nRudolph advanced, pale, but with a calmness of which, afterward, he was\njustly proud. The heroine of the moment turned toward him quickly, with\na look more natural, more sincere, than she had ever given him.\n\n\"Is this Mr. Hackh?\" she said graciously. \"I've heard so much about\nyou!\"\n\nThe young man himself was almost deceived. Was there a German mail-boat?\nWas there a club, from which he had stolen out while she wept,\nignominiously, in that girl's arms? And then of a sudden he perceived,\nwith a fatuous pleasure, how well she knew him, to know that he had\nnever spoken. His English, as he drew up a stool beside Miss Drake, was\nwild and ragged; but he found her an astonishing refuge. For the first\ntime, he recalled that this quiet girl had been beautiful, the other\nnight; and though now by day that beauty was rather of line than of\ncolor, he could not understand how it had been overlooked. Tiffin,\nmeanwhile, sped by like an orgy. He remembered asking so many questions,\nabout the mission hospital and her school for orphans, that the girl\nbegan at last to answer with constraint, and with puzzled, sidelong\nscrutiny. He remembered how even the tolerant Heywood shot a questioning\nglance toward his wine-glass. He remembered telling a brilliant story,\nand reciting \"Old Captain Mau in Vegesack,\"--rhymes long forgotten, now\nfluent and spontaneous. The applause was a triumph. Through it, as\nthrough a haze, he saw a pair of wide blue eyes shining with startled\nadmiration.\n\nBut the best came when the sun had lowered behind the grove, the company\ngrown more silent, and Mrs. Forrester, leaning beside the door of the\ntower, turned the great pegs of a Chinese lute. The notes tinkled like a\nmandolin, but with now and then an alien wail, a lament unknown to the\nWest. \"Sing for us,\" begged the dark-eyed girl; \"a native song.\" The\nother smiled, and bending forward as if to recollect, began in a low\nvoice, somewhat veiled, but musical and full of meaning. \"The Jasmine\nFlower,\" first; then, \"My Love is Gathering Dolichos\"; and then she\nsang the long Ballad of the Rice,--of the husband and wife planting side\nby side, the springing of the green blades, the harvest by millions upon\nmillions of sheaves, the wealth of the State, more fragrant to ancestors\nthan offerings of spice:--\n\n\n\"...O Labor and Love and hallowed Land!\nThink you these things are but still to come?\nThink you they are but near at hand,\nOnly now and here?--Behold.\nThey were the same in years of old!\"\n\n\nIn her plaintive interlude, the slant-eyed servants watched her, nodding\nand muttering under the camphor trees.\n\n\"And here's a song of exile,\" she said. \"I render it very\nbadly.\"--Rudolph had never seen her face like this, bending intently\nabove the lute. It was as though in the music she found and disclosed\nherself, without guile.\n\n\n\"...Blue was the sky,\nAnd blue the rice-pool water lay\nHolding the sky;\nBlue was the robe she wore that day.\nAlas, my sorrow! Why\nMust life bear all away,\nAway, away,\nAh, my beloved, why?\"\n\n\nA murmur of praise went round the group, as she put aside the\ninstrument.\n\n\"The sun's getting low,\" she said lightly, \"and I _must_ see that view\nfrom the top.\" Chantel was rising, but sat down again with a scowl, as\nshe turned to Rudolph. \"You've never seen it, Mr. Hackh? Do come help\nme up.\"\n\nInside, with echoing steps, they mounted in a squalid well, obscurely\nlighted from the upper windows, toward which decaying stairs rose in a\ndangerous spiral, without guard-rail. A misstep being no trifle, Rudolph\noffered his hand for the mere safety; but she took it with a curious\nlittle laugh. They climbed cautiously. Once, at a halt, she stood very\nclose, with eyes shining large in the dusk. Her slight body trembled,\nher head shook with stifled merriment, like a girl overcome by mischief.\n\n\"What a queer little world!\" she whispered. \"You and I here!--I never\ndreamed you could be funny. It made me so proud of you, down there!\"\n\nHe muttered something vague; and--the stairs ending in ruin at the\nfourth story--handed her carefully through the window to a small outer\nbalustrade. As they stood together at the rail, he knew not whether to\nbe angry, suspicious, or glad.\n\n\"I love this prospect,\" she began quietly. \"That's why I wanted you to\ncome.\"\n\nBeyond the camphors, a wide, strange landscape glowed in the full,\nlow-streaming light. The ocean lay a sapphire band in the east; in the\nwest, on a long ridge, undulated the gray battlements of a city, the\nantique walls, warmed and glorified, breasting the flood of sunset. All\nbetween lay vernal fields and hillocks, maidenhair sprays of bamboo, and\na wandering pattern of pink foot-paths. Slowly along one of these, a\nbright-gowned merchant rode a white pony, his bells tinkling in the\nstillness of sea and land. Everywhere, like other bells more tiny and\nshrill, sounded the trilling of frogs.\n\nAs the two on the pagoda stood listening,--\n\n\"It was before Rome,\" she declared thoughtfully. \"Before Egypt, and has\nnever changed. You and I are just--\" She broke off, humming:--\n\n\n\"Only here and now? Behold\nThey were the same in years of old!\"\n\n\nHer mood  the scene: the aged continuity of life oppressed him.\nYet he chose rather to watch the straggling battlements, far off, than\nto meet her eyes or see her hair gleaming in the sun. Through many\ntroubled days he had forgotten her, despised her, bound his heart in\ntriple brass against a future in her hateful neighborhood; and now,\nbeside her at this time-worn rail, he was in danger of being happy. It\nwas inglorious. He tried to frown.\n\n\"You poor boy.\" Suddenly, with an impulse that must have been generous,\nshe rested her hand on his arm. \"I was sorry. I thought of you\nso often.\"\n\nAt these close quarters, her tremulous voice and searching upward glance\nmeant that she alone understood all his troubles. He started, turned for\nsome rush of overwhelming speech, when a head popped through the window\nbehind them.\n\n\"Boot and saddle, Mrs. Forrester,\" announced Heywood. His lean young\nface was very droll and knowing. \"We're leaving, bottom-side.\"\n\n\"Thank you so much, Maurice,\" she answered, perhaps dryly. \"You're a\ndear, to climb all those dreadful stairs.\"\n\n\"Oh!\" said Heywood, with his gray eyes fastened on Rudolph, \"no\ntrouble.\"\n\nAll three went down the dark well together.\n\nWhen the company were mounted, and trooping downhill through the camphor\nshadow, Heywood's pony came sidling against Rudolph's, till legging\nchafed legging.\n\n\"You blossomed, old boy,\" he whispered. \"Quite the star, after your\ncomedy turn.\" He reined aside, grinning. \"What price sympathy on\na pagoda?\"\n\nFor that moment, Rudolph could have struck down the one sure friend he\nhad in China.\n\n\n\nCHAPTER VII\n\n\nIPHIGENIA\n\n\"Don't chop off a hen's head with a battle-axe.\" Heywood, still with a\nmalicious, friendly quirk at the corners of his mouth, held in his\nfretful pony. Rudolph stood bending a whip viciously. They two had\nfetched a compass about the town, and now in the twilight were parting\nbefore the nunnery gate. \"A tiff's the last thing I'd want with you. The\nlady, in confidence, is not worth--\"\n\n\"I do not wish,\" declared Rudolph, trembling,--\"I do not wish you to say\nthose things, so!\"\n\n\"Right!\" laughed the other, and his pony wheeled at the word. \"I'll give\nyou one month--no: you're such a good, thorough little chap, it will\ntake longer--two months, to change your mind. Only\"--he looked down at\nRudolph with a comic, elderly air--\"let me observe, our yellow people\nhave that rather neat proverb. A hen's head, dear chap,--not with a\nbattle-axe! No. Hot weather's coming, too. No sorrows of Werther, now,\nover such\"--He laughed again. \"Don't scowl, I'll be good. I won't say\nit. You'll supply the word, in two months!\"\n\nHe let the pony have his way, and was off in a clatter. Lonely, fuming\nwith resentment, Rudolph stared after him. What could he know, this\nairy, unfeeling meddler, so free with his advice and innuendo? Let him\ngo, then, let him canter away. He had seen quickly, guessed with a\ndiabolic shrewdness, yet would remain on the surface, always, of a\nmystery so violent and so profound. The young man stalked into his\nvacant nunnery in a rage, a dismal pomp of emotion: reason telling him\nthat a friend had spoken sense, imagination clothing him in the sceptred\npall of tragedy.\n\nYet one of these unwelcome words had stuck: he was Werther, it was\ntrue--a man who came too late. Another word was soon fulfilled; for the\nhot weather came, sudden, tropical, ferocious. Without gradation, the\nvernal days and languid noons were gone in a twinkling. The change came\nlike another act of a play. One morning--though the dawn stirred cool\nand fragrant as all dawns before--the \"boy\" laid out Rudolph's white\ntunic, slipped in the shining buttons, smeared pipe-clay on his heaviest\nhelmet; and Rudolph, looking from his window, saw that on the river, by\nthe same instinct, boatmen were stretching up their bamboo awnings.\nBreakfast was hardly ended, before river, and convex field, and huddling\nred tiles of the town, lay under a blurred, quivering distortion. The\nday flamed. At night, against a glow of fiery umber, the western hills\nbroke sharp and thin as sheet-iron, while below them rose in flooding\nmirage a bright strip of magical water.\n\nThus, in these days, he rode for his exercise while the sun still lay\nbehind the ocean; and thus her lively, pointed face and wide blue eyes,\nwondering or downcast or merry, were mingled in his thoughts with the\nfirst rousing of the world, the beat of hoofs in cool silences, the wide\nlights of creation over an aged, weary, alien empire. Their ponies\nwhinnying like old friends, they met, by chance or appointment, before\nthe power of sleep had lifted from eyes still new and strange against\nthe morning. Sometimes Chantel the handsome rode glowering beside them,\nsometimes Gilly, erect and solid in the saddle, laid upon their talk all\nthe weight of his honest, tired commonplaces.\n\nBut one morning she cantered up alone, laughing at her escape. His pony\nbolted, and they raced along together as comrades happily join forces in\na headlong dream. Quivering bamboo swept behind them; the river, on\ntheir other hand, met and passed in hurrying panorama. They had no time\nfor words, but only laughter. Words, indeed, had never yet advanced them\nbeyond that moment on the pagoda. And now, when their ponies fell into\na shambling trot, came the first impulse of speech.\n\n\"How lucky!\" she cried. \"How lucky we came this way! Now I can really\ntest you!\"\n\nHe turned. Her glowing face was now averted, her gesture was not for\nhim, but for the scene. He studied that, to understand her.\n\nThe river, up which they had fled, now rested broad and quiet as a\nshallow lake, burnished faintly, brooded over by a floating, increasing\nlight, not yet compounded into day. Tussocks, innumerable clods and\ncrumbs of vivid green, speckled all the nearer water. On some of these\nstorks meditated,--sage, pondering heads and urbane bodies perched high\non the frailest penciling of legs. In the whole expanse, no movement\ncame but when a distant bird, leaving his philosophic pose, plunged\ndownward after a fish. Beyond them rose a shapeless mound or isle, like\nsome half-organic monster grounded in his native ooze.\n\n\"There!\" said the woman, pointing. \"Are you all excuses, like the\nothers? Or do you dare?\"\n\n\"I am not afraid of anything--now,\" retorted Rudolph, and with truth,\nafter the dash of their twilight encounter. \"Dare what?\"\n\n\"Go see what's on that island,\" she answered. \"I dared them all. Twice\nI've seen natives land there and hurry away. Mr. Nesbit was too lazy to\ntry; Dr. Chantel wearing his best clothes. Maurice Heywood refused to\nmire his horse for a whim. Whim? It's a mystery! Come, now. Do\nyou dare?\"\n\nIn a rare flush of pride, Rudolph wheeled his stubborn mount and bullied\nhim down the bank. A poor horseman, he would have outstripped Curtius to\nthe gulf. But no sooner had his dancing pony consented to make the first\nrebellious, sidelong plunge, than he had small joy of his boast.\nFore-legs sank floundering, were hoisted with a terrified wrench of the\nshoulders, in the same moment that hind-legs went down as by suction.\nThe pony squirmed, heaved, wrestled in a frenzy, and churning the red\nwater about his master's thighs, went deeper and fared worse. With a\nclangor of wings, the storks rose, a streaming rout against the sky,\ntrailed their tilted legs, filed away in straggling flight, like figures\ninterlacing on a panel. At the height of his distress, Rudolph caught a\nwhirling glimpse of the woman above him, safe on firm earth, easy in her\nsaddle, and laughing. Quicksand, then, was a joke,--but he could not\npause for this added bewilderment.\n\nThe pony, using a skill born of agony, had found somewhere a solid verge\nand scrambled up, knee-deep, well out from the bank. With a splash,\nRudolph stood beside him among the tufts of salad green. As he patted\nthe trembling flanks, he heard a cry from the shore.\n\n\"Oh, well done!\" she mocked them. \"Well done!\"\n\nA gust of wholesome anger refreshed him. She might laugh, but now he\nwould see this folly through. He tore off his coat, flung it across the\nsaddle, waded out alone through the tussocks, and shooting forward full\nlength in the turbid water, swam resolutely for the island.\n\nSky and water brightened while he swam; and as he rose, wrapped in the\nleaden weight of dripping clothes, the sun, before and above him,\ntouched wonderfully the quaggy bank and parched grasses. He lurched\nashore, his feet caked with enormous clods as of melting chocolate. A\nfilthy scramble left him smeared and disheveled on the summit. He had\ncome for nothing. The mound lay vacant, a tangled patch, a fragment of\nwilderness.\n\nYet as he stood panting, there rose a puny, miserable sound. What\npresence could lurk there? The distress, it might be, of some small\nanimal--a rabbit dying in a forgotten trap. Faint as illusion, a wail, a\nthin-spun thread of sorrow, broke into lonely whimpering, and ceased. He\nmoved forward, doubtfully, and of a sudden, in the scrubby level of the\nisle, stumbled on the rim of a shallow circular depression.\n\nAt first, he could not believe the discovery; but next instant--as at\nthe temple pond, though now without need of placard or interpreter--he\nunderstood. This bowl, a tiny crater among the weeds, showed like some\npaltry valley of Ezekiel, a charnel place of Herod's innocents, the\nbattlefield of some babes' crusade. A chill struck him, not from the\nwater or the early mists. In stupor, he viewed that savage fact.\n\nThrough the stillness of death sounded again the note of living\ndiscontent. He was aware also of some stir, even before he spied, under\na withered clump, the saffron body of an infant girl, feebly squirming.\nBy a loathsome irony, there lay beside her an earthen bowl of rice, as\nan earnest or symbol of regret.\n\nBlind pity urged him into the atrocious hollow. Seeing no further than\nthe present rescue, he caught up the small unclean sufferer, who moaned\nthe louder as he carried her down the bank, and waded out through the\nsludge. To hold the squalling mouth above water, and swim, was no simple\nfeat; yet at last he came floundering among the tussocks, wrapped the\nnaked body in his jacket, and with infinite pains tugged his terrified\npony along a tortuous bar to the land.\n\nOnce in the river-path, he stood gloomily, and let Mrs. Forrester canter\nup to join him. Indeed, he had almost forgotten her.\n\n\"Splendid!\" she laughed. \"What a figure of fun! But what can you have\nbrought back? Oh, please! I can't wait!\"\n\nHe turned on her a muddy, haggard face, without enthusiasm, and gently\nunfolded the coat. The man and the woman looked down together, in\nsilence, at the child. He had some foolish hope that she would take it,\nthat his part was ended. Like an outlandish doll, with face contorted\nand thick-lidded eyes shut tightly against the sunshine, the outcast\nwhimpered, too near the point of death for even the rebellion of\narms and legs.\n\nThe woman in the saddle gave a short, incredulous cry. Her face, all gay\ncuriosity, had darkened in a shock of disgust.\n\n\"What in the world!\" she scolded. \"Oh! Such a nasty little--Why\ndid--What do you propose doing with it?\"\n\nRudolph shook his head, like a man caught in some stupid blunder.\n\n\"I never thought of that,\" he explained heavily. \"She has no--no\nfriends.\"\n\n\"Cover it,\" his companion ordered. \"Cover it up. I can't bear to see\nit.\"\n\nWith a sombre, disappointed air, he obeyed; then looked up, as if in her\nface he read strange matter.\n\n\"I can't bear,\" she added quickly, \"to see any kind of suffering. Why\ndid--It's all my fault for sending you! We were having such a good ride\ntogether, and now I've spoiled it all, with this.--Poor little filthy\nobject!\" She turned her hands outward, with a helpless, dainty gesture.\n\"But what can we do? These things happen every day.\"\n\nRudolph was studying the ground again. His thoughts, then, had wronged\nher. Drenched and downhearted, holding this strange burden in his\njacket, he felt that he had foolishly meddled in things inevitable,\nbeyond repair. She was right. Yet some vague, insurgent instinct, which\nwould not down, told him that there had been a disappointment. Still,\nwhat had he expected? No woman could help; no woman.\n\nThen suddenly he mounted, bundle and all, and turned his willing pony\nhomeward.\n\n\"Come,\" he said; and for the first time, unwittingly, had taken charge.\n\n\"What is it?\" she called. \"You foolish boy! What's your plan?\"\n\n\"We shall see,\" he answered. Without waiting, he beckoned her to follow.\nShe came. They rode stirrup to stirrup, silent as in their escape at\ndawn, and as close bodily, but in spirit traveling distant parallels. He\ngave no thought to that, riding toward his experiment. Near the town, at\nlast, he reined aside to a cluster of buildings,--white walls and rosy\ntiles under a great willow.\n\n\"You may save your steps,\" she declared, with sudden petulance. \"The\nhospital's more out of funds than ever, and more crowded. They'll not\nthank you.\"\n\nRudolph nodded back at her, with a queer smile, half reckless and half\nconfident.\n\n\"Then,\" he replied, dismounting, \"I will replenish my nunnery.\"\n\nSquatting coolies sprang up and raced to hold his pony. Others, in the\nshade of the wall, cackled when they saw a Son of the Red-Haired so\nbeplastered and sopping. A few pointed at his bundle, with grunts of\nsudden interest; and a leper, bearing the visage as of a stone lion\ndefaced by time, cried something harshly. At his words, the whole band\nof idlers began to chatter.\n\nRudolph turned to aid his companion. She sat watching them sharply. An\nuneasy light troubled the innocent blue eyes, which had not even a\nglance for him.\n\n\"No, I shan't get down,\" she said angrily. \"It's just what might\nbe--Your little brat will bring no good to any of us.\"\n\nHe flung away defiantly, strode through the gate, and calling aloud,\ntraversed an empty compound, already heated by the new-risen sun. A\ncooler fringe of veranda, or shallow cloister, lined a second court. Two\nfigures met him,--the dark-eyed Miss Drake, all in white, and behind\nher a shuffling, grinning native woman, who carried a basin, in which\npermanganate of potash swam gleaming like diluted blood.\n\n\"Good-morning.\" With one droll look of amusement, the girl had\nunderstood, and regained that grave yet happy, friendly composure which\nhad the virtue, he discovered, of being easily forgotten, to be met each\ntime like something new. \"What have you there for us?\"\n\nAgain he unfolded the jacket.\n\n\"A child.\"\n\nThe naked mite lay very still, the breath weakly fluttered. A somewhat\nnauseous gift, the girl raised her arms and received it gently, without\nhaste,--the saffron body appearing yet more squalid against the\nPalladian whiteness of her tunic, plain and cool as drapery in marble.\n\n\"It may live,\" she said. \"We'll do what we can.\" And followed by the\nblack-trousered woman, she moved quickly away to offer battle with\ndeath. A plain, usual fact, it seemed, involving no more surprise than\nrepugnance. Her face had hardly altered; and yet Rudolph, for the first\ntime in many days, had caught the fleeting brightness of compassion.\nMere light of the eyes, a half-imagined glory, incongruous in the sharp\nsmell of antiseptics, it left him wondering in the cloister. He knew now\nwhat had been missing by the river. \"I was naked, and\"--how ran the\nlines? He turned to go, recalling in a whirl snatches of truth he had\nnever known since boyhood, never seen away from home.\n\nAcross a court the padre hailed him,--a tall, ungainly patriarch under\nan enormous mushroom helmet of solar pith,--and walking along beside,\nlistened shrewdly to his narrative. They paused at the outer gate. The\npadre, nodding, frowning slightly, stood at ease, all angles and loose\njoints, as if relaxed by the growing heat.\n\nSuddenly he stood erect as a grenadier.\n\n\"That lie again!\" he cried. \"Listen!\"\n\nThe leper, without, harangued from his place apart, in a raucous voice\nfilled with the solitary pride of intellect.\n\n\"Well, men shall revile you,\" growled Dr. Earle. \"He says we steal\nchildren, to puncture their eyes for magic medicine!\"\n\nThen, heaving his wide shoulders,--\n\n\"Oh, well!\" he said wearily, \"thanks, anyhow. Come see us, when we're\nnot so busy? Good!--Look out these fellows don't fly at you.\"\n\nTired and befouled, Rudolph passed through into the torrid glare. The\nleper cut short his snarling oration. But without looking at him, the\nyoung man took the bridle from the coolie. There had been a test. He had\nseen a child, and two women. And yet it was with a pang he found that\nMrs. Forrester had not waited.\n\n\n\nCHAPTER VIII\n\n\nTHE HOT NIGHT\n\nRudolph paced his long chamber like a wolf,--a wolf in summer, with too\nthick a coat. In sweat of body and heat of mind, he crossed from window\nto window, unable to halt.\n\nA faintly sour smell of parched things, oppressing the night without\nbreath or motion, was like an interminable presence, irritating,\npoisonous. The punkah, too, flapped incessant, and only made the lamp\ngutter. Broad leaves outside shone in mockery of snow; and like snow the\nstifled river lay in the moonlight, where the wet muzzles of buffaloes\nglistened, floating like knots on sunken logs, or the snouts of\ncrocodiles. Birds fluttered, sleepless and wretched. Coolies, flung\nasleep on the burnt grass, might have been corpses, but for the sound of\ntheir troubled breathing.\n\n\"If I could believe,\" he groaned, sitting with hands thrust through his\nhair. \"If I believe in her--But I came too late.\"\n\nThe lamp was an added torment. He sprang up from it, wiped the drops off\nhis forehead, and paced again. He came too late. All alone. The collar\nof his tunic strangled him. He stuffed his fingers underneath, and\nwrenched; then as he came and went, catching sight in a mirror, was\nshocked to see that, in Biblical fashion, he had rent his garments.\n\n\"This is bad,\" he thought, staring. \"It is the heat. I must not stay\nalone.\"\n\nHe shouted, clapped his hands for a servant, and at last, snatching a\ncoat from his unruffled boy, hurried away through stillness and\nmoonlight to the detested club. On the stairs a song greeted him,--a\nfragment with more breath than melody, in a raw bass:--\n\n\n\"Jolly boating weather,\nAnd a hay harvest breeze!\"\n\n\n\"Shut up!\" snarled another voice. \"Good God, man!\"\n\nThe loft was like a cave heated by subterranean fires. Two long punkahs\nflapped languidly in the darkness, with a whine of pulleys. Under a\nswinging lamp, in a pool of light and heat, four men sat playing cards,\ntheir tousled heads, bare arms, and cinglets torn open across the chest,\ngiving them the air of desperadoes.\n\n\"Jolly boating weather,\" wheezed the fat Sturgeon. He stood apart in\nshadow, swaying on his feet. \"What would you give,\" he propounded\nthickly, \"for a hay harvest breeze?\"\n\nHe climbed, or rolled, upon the billiard-table, turned head toward\npunkah, and suddenly lay still,--a gross white figure, collapsed and\nsprawling.\n\n\"How much does he think a man can stand?\" snapped Nesbit, his lean\nCockney face pulled in savage lines. \"Beast of a song! He'll die\nto-night, drinking.\"\n\n\"Die yourself,\" mumbled the singer, \"'m goin' sleep. More 'n you can\ndo.\"\n\nA groan from the players, and the vicious flip of a card, acknowledged\nthe hit. Rudolph joined them, ungreeting and ungreeted. The game went on\ngrimly, with now and then the tinkle of ice, or the popping of soda\nbottles. Sharp cords and flaccid folds in Wutzler's neck, Chantel's\nbrown cheeks, the point of Heywood's resolute chin, shone wet and\npolished in the lamplight. All four men scowled pugnaciously, even the\npale Nesbit, who was winning. Bad temper filled the air, as palpable as\nthe heat and stink of the burning oil.\n\nOnly Heywood maintained a febrile gayety, interrupting the game\nperversely, stirring old Wutzler to incoherent speech.\n\n\"What's that about Rome?\" he asked. \"You were saying?\"\n\n\"Rome is safed!\" cried the outcast, with sudden enthusiasm. \"In your\npaper _Tit-bit_, I read. How dey climb der walls op, yes, but Rome is\nsafed by a flook of geeze. Gracious me, der History iss great sopjeck!\nI lern moch.--But iss Rome yet a fortify town?\"\n\nChantel rapped out a Parisian oath.\n\n\"Do we play cards,\" he cried sourly, \"or listen to the chatter of\nsenility?\"\n\nHeywood held to the previous question.\n\n\"No, Wutz, that town's no longer fortified,\" he answered slowly. \"Geese\nlive there, still, as in--many other places.\"\n\nDr. Chantel examined his finger-tips as though for some defect; then,\nsnatching up the cards, shuffled and dealt with intense precision. The\ngame went on as before.\n\n\"I read alzo,\" stammered Wutzler, like a timid scholar encouraged to\nlecture, \"I read zo how your Englishman, Rawf Ralli, he spreadt der fine\nclock for your Queen, and lern your Queen smoking, no?\" He mopped his\nlean throat with the back of his hand. \"In Bengal are dere Rallis. Dey\nhandle jute.\"\n\n\"Yes?\" Heywood smiled a weary indulgence. Next instant he whirled on\nRudolph in fury.--\"Is this a game, or Idiot's Joy?\"\n\n\"I'm playing my best,\" explained Rudolph, sulkily.\n\n\"Then your best is the worst I ever saw! Better learn, before sitting\nin!\"\n\nChantel laughed, without merriment; Rudolph flung down his cards,\nstalked to the window, and stood looking out, in lonely, impotent rage.\nA long time passed, marked by alarming snores from the billiard-table.\nThe half-naked watchers played on, in ferocious silence. The night wore\nalong without relief.\n\nHours might have lapsed, when Dr. Chantel broke out as though the talk\nhad but paused a moment.\n\n\"So it goes!\" he sneered. \"Fools will always sit in, when they do not\nknow. They rush into the water, also, and play the hero!\"\n\nAgain his laughter was brief but malignant. Heywood had left his cards,\nrisen, and crossing the room, stood looking over Rudolph's shoulder into\nthe snowy moonlight. On the shoulder his hand rested, as by accident.\n\n\"It's the heat, old chap,\" he said wearily. \"Don't mind what we say\nto-night.\"\n\nRudolph made no sign, except to move from under his hand, so that, with\ntheir quarrel between them, the two men stared out across the blanched\nroofs and drooping trees, where long black shadows at last crept\ntoward the dawn.\n\n\"These heroes!\" continued the mocker. \"What is danger? Pouf--nothing!\nThey make it for the rest of us, so easily! Do you know,\" his voice rose\nand quickened, \"do you know, the other end of town is in an uproar? We\nmurder children, it appears, for medicine!\"\n\nRudolph started, turned, but now sat quiet under Heywood's grasp.\nChantel, in the lamplight, watched the punkahs with a hateful smile.\n\n\"The Gascons are not all dead,\" he murmured. \"They plunge us all into a\nturmoil, for the sake of a woman.\" He made a sudden startling gesture,\nlike a man who has lost control. \"For the sake,\" he cried angrily, \"of a\nperson we all know! Oh! we all know her! She is nothing more--\"\n\nThere was a light scuffle at the window.\n\n\"Dr. Chantel,\" began Heywood, with a sharp and dangerous courtesy, \"we\nare all unlike ourselves to-night. I am hardly the person to remind you,\nbut this club is hardly the place--\"\n\n\"Oh, la la!\" The other snapped his fingers, and reverting to his native\ntongue, finished his sentence wildly.\n\n\"You cad!\" Heywood advanced in long strides deliberately, as if\ngathering momentum for a collision. Before his blow could fall, he was\nsent spinning. Rudolph, his cheeks on fire, darted past and dealt, full\nforce, a clumsy backhand sweep of the arm. Light and quick as a leopard,\nChantel was on foot, erect, and even while his chair crashed on the\nfloor, had whipped out a handkerchief.\n\n\"You are right, Mr. Heywood,\" he said, stanching his lips, in icy\ncomposure. His eyes held an odd gleam of satisfaction. \"You are right.\nWe are not like ourselves, at present. I will better ask Mr. Sturgeon to\nsee your friend to-morrow morning. This morning, rather.\"\n\nNot without dignity, he turned, stepped quickly to the stairs, saluted\ngravely, and went down.\n\n\"No, no!\" panted Nesbit, wrestling with Rudolph. \"Easy on, now! Let you\ngo? No fear!\"\n\nHeywood wrenched the captive loose, but only to shake him violently, and\nthrust him into a chair.\n\n\"Be quiet, you little ass!\" he scolded. \"I've a great mind, myself, to\nrun after the bounder and kick him. But that sort of thing--you did\nenough. Who'd have thought? You young spitfire! Chantel took you on,\nexactly as he wanted.\"\n\nThe fat sleeper continued to snore. Wutzler came slinking back from his\nrefuge in the shadows.\n\n\"It iss zo badt!\" he whined, gulping nervously. \"It iss zo badt!\"\n\n\"Right you are,\" said Heywood. With arms folded, he eyed them sternly.\n\"It's bad. We might have known. If only I'd reached him first! By Jove,\nyou must let me fight that beast. Duels? The idiot, nobody fights duels\nany more. I've always--His cuffs are always dirty, too, on the inside!\"\n\nRudolph leaned back, like a man refreshed and comforted, but his laugh\nwas unsteady, and too boisterous.\n\n\"It is well,\" he bragged. \"Pistol-bullets--they fly on the wings of\nchance! No?--All is well.\"\n\n\"Pistols? My dear young gentleman,\" scoffed his friend, \"there's not a\npair of matched pistols in the settlement. And if there were, Chantel\nhas the choice. He'll take swords.\"\n\nHe paused, in a silence that grew somewhat menacing. From a slit in the\nwall the wheel of the punkah-thong whined insistently,--rise and fall,\nrise and fall of peevish complaint, distressing as a brain-fever bird.\n\n\"Swords, of course,\" continued Heywood. \"If only out of vanity.\nFencing,--oh, I hate the man, and the art's by-gone, if you like, but\nhe's a beautiful swordsman! Wonderful!\"\n\nRudolph still lay back, but now with a singular calm.\n\n\"It's just as well,\" he declared quietly.\n\nHeywood loosed a great breath, a sigh of vast relief.\n\n\"My word!\" he cried, grinning. \"So you're there, too, eh? You young\nSly-boots! If you're another expert--Bravo! We'll beat him at his own\ngame! Hoist with his own what-d'-ye-call-it! I'd give anything\"--He\nthumped the table, and pitched the cards broadcast, like an explosion of\nconfetti, in a little carnival of glee. \"You old Sly-boots!--But are you\nsure? He's quick as lightning.\"\n\n\"I am not afraid,\" replied Rudolph, modestly. He trained his young\nmoustache upward with steady fingers, and sat very quiet, thinking long\nthoughts. A quaint smile played about his eyes.\n\n\"Good for you!\" said Heywood. \"Now let him come, as the Lord Mayor said\nof the hare. What sport! With an even chance--And what a load off\none's mind!\"\n\nHe moved away to the window, as though searching for air. Instead of\nmoonlight, without, there swam the blue mist of dawn.\n\n\"Not a word must ever reach old Gilly,\" he mused. \"Do you hear, Nesbit?\"\n\n\"If you think,\" retorted the clerk, stiffly, \"I don't know the proper\ncourse of be'aviour! Not likely!\"\n\nThe tall silhouette in the window made no reply, but stood grumbling\nprivately: \"A club! Yes, where we drink out of jam-pots--dead cushions,\ndead balls--no veranda--fellow that soils the inside of his cuffs first!\nWe're a pack of beach-combers.\"\n\nHe propped his elbows on the long sill, and leaned out, venting\nfragments of disgust. Then of a sudden he turned, and beckoned eagerly.\n\"Come here, you chaps. Look-see.\"\n\nThe others joined him. Gray vapors from river and paddy-field, lingering\nlike steam in a slow breeze, paled and dispersed in the growing light,\nas the new day, worse than the old, came sullenly without breath or\nrespite. A few twilight shapes were pattering through the narrow\nstreet--a squad of Yamen runners haling a prisoner.\n\n\"The Sword-Pen remains active,\" said Heywood, thoughtfully. \"That dingy\nlittle procession, do you know, it's quite theatrical? The Cross and the\nDragon. Eh? Another act's coming.\"\n\nEven Rudolph could spare a misgiving from his own difficulty while he\nwatched the prisoner. It was Chok Chung, the plump Christian merchant,\nslowly trudging toward the darkest of human courts, to answer for the\ndeath of the cormorant-fisher. The squad passed by. Rudolph saw again\nthe lighted shop, the tumbled figure retching on the floor; and with\nthese came a memory of that cold and scornful face, thinking so cruelly\namong the unthinking rabble. The Sword-Pen had written something in\nthe dark.\n\n\"I go find out\"; and Wutzler was away, as keen as a village gossip.\n\n\"Trouble's comin',\" Nesbit asserted glibly. \"There's politics afloat.\nBut I don't care.\" He stretched his arms, with a weary howl. \"That's the\nfirst yawn I've done to-night. Trouble keeps, worse luck. I'm off--seek\nmy downy.\"\n\nAlone with the grunting sleeper, the two friends sat for a long time and\nwatched the flooding daylight.\n\n\"What,\" began Rudolph, suddenly, and his voice trembled, \"what is your\ntrue opinion? You are so kind, and I was just a fool. That other day, I\nwould not listen. You laughed. Now tell me, so--as you were to die next.\nYou were joking? Can I truly be proud of--of her?\"\n\nHe leaned forward, white and eager, waiting for the truth like a dicer\nfor the final throw.\n\n\"Of yourself, dear old chap. Not of the lady. She's the fool, not you.\nPoor old Gilly Forrester slaves here to send her junketing in Japan,\nKashmir, Ceylon, Home. What Chantel said--well, between the two of us,\nI'm afraid he's right. It's a pity.\"\n\nHeywood paused, frowning.\n\n\"A pity, too, this quarrel. So precious few of us, and trouble ahead.\nThe natives lashing themselves into a state of mind, or being lashed.\nThe least spark--Rough work ahead, and here we are at swords' points.\"\n\n\"And the joke is,\" Rudolph added quietly, \"I do not know a sword's point\nfrom a handle.\"\n\nHeywood turned, glowered, and twice failed to speak.\n\n\"Rudie--old boy,\" he stammered, \"that man--Preposterous! Why, it's plain\nmurder!\"\n\nRudolph stared straight ahead, without hope, without illusions, facing\nthe haggard light of morning. A few weeks ago he might have wept; but\nnow his laugh, short and humorous, was worthy of his companion.\n\n\"I do not care, more,\" he answered. \"Luck, so called I it, when I\nescaped the militar' service. Ho ho! Luck, to pass into the _Ersatz!_--I\ndo not care, now. I cannot believe, even cannot I fight.\nWorthless--dreamer! My deserts. It's a good way out.\"\n\n\n\nCHAPTER IX\n\n\nPASSAGE AT ARMS\n\n\"Boy.\"\n\n\"Sai.\"\n\n\"S'pose Mr. Forrester bym-by come, you talkee he, master no got, you\nchin-chin he come-back.\"\n\n\"Can do.\"\n\nThe long-coated boy scuffed away, across the chunam floor, and\ndisappeared in the darkness. Heywood submitted his head once more to the\nnimble hands of his groom, who, with horse-clippers and a pair of\nenormous iron shears, was trimming the stubborn chestnut locks still\ncloser. The afternoon glow, reflected from the burnt grass and white\nwalls of the compound, struck upward in the vault-spaces of the ground\nfloor, and lighted oddly the keen-eyed yellow mafoo and his serious\nyoung master.\n\nNesbit, pert as a jockey, sat on the table swinging his feet furiously.\n\n\"Sturgeon would take it all right, of course,\" he said, with airy\nwisdom. \"Quite the gentleman, he is. Netch'rally. No fault of his.\"\n\n\"Not the least,\" Heywood assented gloomily. \"Did everything he could.\nIf I were commissioned to tell 'em outright--'The youngster can't\nfence'--why, we might save the day. But our man won't even listen to\nthat. Fight's the word. Chantel will see, on the spot, directly they\nface. But will that stop him? No fear: he's worked up to the pitch of\nkilling. He'll lunge first, and be surprised afterward.--So regrettable!\nSuch remorse!--Oh, I know _him!_\"\n\nThe Cockney fidgeted for a time. His face--the face of a street-bred\nurchin--slowly worked into lines of abnormal cunning.\n\n\"I say! I was thinking,\" he ventured at last. \"Two swords, that's all?\nJust so. Now--my boy used to be learn-pidgin at Chantel's. Knows that\n'ouse inside out--loafs there now, the beggar, with Chantel's cook. Why\nnot send him over--prowling, ye know--fingers the bric-a-brac, bloomin'\nass, and breaks a sword-blade. Perfectly netch'ral. 'Can secure, all\nplopah,' Accident, ye know. All off with their little duel. What?\"\n\nHeywood chuckled, and bowed his head to the horse-clippers.\n\n\"Last week,\" he replied. \"Not to-day. This afternoon's rather late for\naccidents. You make me feel like Pompey on his galley: 'This thou\nshouldst have done, and not have spoken on't,'--Besides, those swords\nbelonged to Chantel's father. He began as a gentleman.--But you're a\ngood sort, Nesbit, to take the affair this fashion.\"\n\nLost in smoke, the clerk grumbled that the gory affair was unmentionable\nnonsense.\n\n\"Quite,\" said Heywood. \"We've tried reasoning. No go. As you say, an\naccident. That's all can save the youngster now. Impossible, of course.\"\nHe sighed. Then suddenly the gray eyes lighted, became both shrewd and\ndistant; a malicious little smile stole about the corners of his mouth.\n\"Have-got! The credit's yours, Nesbit. Accident: can do. And this\none--by Jove, it won't leave either of 'em a leg to stand on!--Here,\nmafoo, makee finish!\"\n\nHe sprang up, clapped a helmet on the shorn head, and stalked out into\nthe sunlight.\n\n\"Come on,\" he called. \"It's nearly time. We must pick up our young\nHotspur.\"\n\nThe clerk followed, through the glowing compound and the road. In the\nshade of the nunnery gate they found Rudolph, who, raising his rattan,\nsaluted them with a pale and stoic gravity.\n\n\"Are we ready?\" he asked; and turning, took a slow, cool survey of the\nnunnery, as though looking his last--from the ditch at their feet to the\nred tiles, patched with bronze mould, that capped the walls and the\nroof. \"I never left any place with less regret. Come, let's go.\"\n\nThe three men had covered some ground before Rudolph broke the silence.\n\n\"You'll find a few little things up there in my strong-box, Maurice.\nSome are marked for you, and the rest--will you send them Home, please?\"\nHe hesitated. \"I hope neither of you will misunderstand me. I'm horribly\nafraid, but not--but only because this fellow will make me look absurd.\nIf I knew the first motion!\" He broke out angrily. \"I cannot bear to\nhave him laugh, also! I cannot bear!\"\n\nHeywood clapped him on the shoulder, and gave a queer cough.\n\n\"If that's all, never you fear! I'll teach you your guard. 'Once in a\nwhile we can finish in style.' Eh?--Rudie, you blooming German, I--I\nthink we must have been brothers! We'll pull it off yet.\"\n\nHeywood spoke with a strange alacrity, and tried again to cough. This\ntime, however, there was no mistake--he was laughing.\n\nRudolph shot at him one glance of startled unbelief, and then, tossing\nhis head, marched on without a word. Pride and loneliness overwhelmed\nhim. The two at his side were no companions--not even presences. He\nwent alone, conscious only of the long flood of sunset, and the black\ninterlacing pattern of bamboos. The one friendly spirit had deserted,\nlaughing; yet even this last and worst of earthly puzzles did not\nmatter. It was true, what he had read; this, which they called death,\nwas a lonely thing.\n\nOn a broken stone bench, Sturgeon, sober and dejected, with puffy\ncircles under his eyes, sat waiting. A long parcel, wrapped in green\nbaize, lay across his knees. He nodded gloomily, without rising. At his\nfeet wandered a path, rankly matted with burnt weeds, and bordered with\ngreen bottle-ends, the \"dimples\" choked with discs of mud. The place was\na deserted garden, where the ruins of a European house--burnt by natives\nin some obscure madness, years ago--sprawled in desolation among wild\nshrubs. A little way down the path stood Teppich and Chantel, each with\nhis back turned and his hands clasped, like a pair of sulky Napoleons,\none fat, one slender. The wooden pretense of their attitude set Rudolph,\nfor an instant, to laughing silently and bitterly. This final\nscene,--what justice, that it should be a mean waste, the wreck of silly\npleasure-grounds, long forgotten, and now used only by grotesque\nplay-actors. He must die, in both action and setting, without dignity.\nIt was some comfort, he became aware, to find that the place was fairly\nprivate. Except for the breach by which they had entered, the blotched\nand spotted compound walls stood ruinous yet high, shutting out all but\na rising slant of sunlight, and from some outpost line of shops, near\nby, the rattle of an abacus and the broken singsong of argument, now\nharsh, now drowsy.\n\nHeywood had been speaking earnestly to Sturgeon:--\n\n\"A little practice--try the balance of the swords. No more than fair.\"\n\n\"Fair? Most certainly,\" croaked that battered convivialist. \"Chantel\ncan't object.\"\n\nHe rose, and waddled down the path. Rudolph saw Chantel turn, frowning,\nthen nod and smile. The nod was courteous, the smile full of satire. The\nfat ambassador returned.\n\n\"Right-oh,\" he puffed, tugging from the baize cover a shining pair of\nbell-hilted swords. \"Here, try 'em out.\" His puffy eyes turned furtively\ntoward Rudolph. \"May be bad form, Hackh, but--we all wish you luck, I\nfancy.\" Then, in a burst of candor, \"Wish that unspeakable ass felt as\nseedy as I do--heat-stroke--drop dead--that sort of thing.\"\n\nStill grumbling treason, this strange second rejoined his principal.\n\n\"Jackets off,\" commanded Heywood; and in their cinglets, each with sword\nunder arm, the two friends took shelter behind a ragged clump of\nplantains. The yellow leaves, half dead with drought and blight, hung\nponderous as torn strips of sheet metal in the lifeless air.\n\nBehind this tattered screen, Rudolph studied, for a moment, the lethal\nobject in his hand. It was very graceful,--the tapering, three-cornered\nblade, with shallow grooves in which blood was soon to run, the silver\nhilt where his enemy's father had set, in florid letters, the name of\n\"H.B. St. A. Chantel,\" and a date. How long ago, he thought, the steel\nwas forged for this day.\n\n\"It is Fate.\" He looked up sadly. \"Come, show me how to begin; so that I\ncan stand up to him.\"\n\n\"Here, then.\" Slowly, easily, his long limbs transformed with a sudden\nyouthful grace, Heywood moved through the seven positions of On\nGuard. \"Try it.\"\n\nRudolph learned only that his own clumsy imitation was hopeless.\n\n\"Once more.--He can't see us.\"\n\nAgain and again, more and more rapidly, they performed the motions of\nthis odd rehearsal. Suddenly Heywood stepped back, and lowering his\npoint, looked into his pupil's face, long and earnestly.\n\n\"For the last time,\" he said: \"won't you let me tell him? This is\nextremely silly.\"\n\nRudolph hung his head, like a stubborn child.\n\n\"Do you still think,\" he answered coldly, \"that I would beg off?\"\n\nWith a hopeless gesture of impatience, Heywood stepped forward briskly.\n\"Very well, then. Once more.\" And as their blades clashed softly\ntogether, a quick light danced in his eyes. \"Here's how our friend will\nstick you!\" His point cut a swift little circle, and sped home. By a\nwild instinct, the novice beat it awkwardly aside. His friend laughed,\npoised again, disengaged again, but in mid-career of this heartless\nplay, stumbled and came pitching forward. Rudolph darted back, swept his\narm blindly, and cried out; for with the full impetus of the mishap, a\nshock had run from wrist to elbow. He dropped his sword, and in\nstupefaction watched the red blood coursing down his forearm, and his\nthird finger twitching convulsively, beyond control.\n\n\"Dear fellow!\" cried his opponent, scrambling upright. \"So sorry! I say,\nthat's a bad one.\" With a stick and a handkerchief, he twisted on a\ntourniquet, muttering condolence: \"Pain much? Lost my balance, you know.\nThat better?--What a clumsy accident!\" Then, dodging out from the\nplantain screen, and beckoning,--\"All you chaps! Come over here!\"\n\nNesbit came running, but at sight of the bloody victim, pulled up short.\n\"What ho!\" he whispered, first with a stare, then a grin of mysterious\njoy. Sturgeon gave a sympathetic whistle, and stolidly unwound bandages.\nAt first the two Napoleons remained aloof, but at last, yielding to\nindignant shouts, haughtily approached. The little group stood at fault.\n\nHeywood wiped his sword-blade very carefully on a plantain leaf; then\nstood erect, to address them with a kind of cool severity.\n\n\"I regret this more than anybody,\" he declared, pausing, and picking his\nwords. \"We were at practice, and my friend had the misfortune to be run\nthrough the arm.\"\n\nChantel flung out his hands, in a motion at once furious and impudent.\n\n\"Zut! What a farce!--Will you tell me, please, since your friend has\ndisabled himself\"--\n\nHeywood wheeled upon him, scornfully.\n\n\"You have no right to such an expression,\" he stated, with a coldness\nwhich conveyed more rage than the other man's heat. \"This was entirely\nmy fault. It's I who have spoiled your--arrangement, and therefore I am\nquite ready to take up my friend's quarrel.\"\n\n\"I have no quarrel with you,\" replied Chantel, contemptuously. \"You saw\nlast night how he--\"\n\n\"He was quicker than I, that's all. By every circumstance, I'm the\nnatural proxy. Besides\"--the young man appealed to the company,\nsmiling--\"besides, what a pity to postpone matters, and spoil the\noccasion, when Doctor Chantel has gone to the trouble of a clean shirt.\"\n\nThe doctor recoiled, flung up a trembling arm, and as quickly dropped\nit. His handsome face burned darker, then faded with a mortal pallor,\nand for one rigid moment, took on such a strange beauty as though it\nwere about to be translated into bronze. His brown fingers twitched,\nbecame all nerves and sinews and white knuckles. Then, stepping\nbackward, he withdrew from the circle.\n\n\"Very well,\" he said lightly. \"Since we are all so--irregular. I will\ntake the substitute.\"\n\nRudolph gave a choking cry, and would have come forward; but Sturgeon\nclung to the wounded arm, and bound on his bandage.\n\n\"Hold still, there!\" he scolded, as though addressing a horse; then\ngrowled in Heywood's ear, \"Why did _you_ go lose your temper?\"\n\n\"Didn't. We can't let him walk over us, though.\" The young man held the\nsword across his throat, and whispered, \"Only angry up to here!\"\n\nAnd indeed, through the anxious preliminary silence, he stood waiting as\ncool and ready as a young centurion.\n\nHis adversary, turning back the sleeves of the unfortunate white linen,\npicked up the other sword, and practiced his fingering on the silver\nhilt, while the blade answered as delicately as the bow to a violinist.\nAt last he came forward, with thin lips and hard, thoughtful eyes, like\na man bent upon dispatch. Both men saluted formally, and sprang\non guard.\n\nFrom the first twitter of the blades, even Rudolph knew the outcome.\nHeywood, his face white and anxious in the failing light, fought at full\nstretch, at the last wrench of skill. Chantel, for the moment, was\nfencing; and though his attacks came ceaseless and quick as flame, he\nwas plainly prolonging them, discarding them, repeating, varying,\nwhether for black-hearted merriment, or the vanity of perfect form, or\nlove of his art. Graceful, safe, easy, as though performing the grand\nsalute, he teased and frolicked, his bright blade puzzling the sight,\nscattering like quicksilver in the endless whirl and clash.\n\nTeppich was gaping foolishly, Sturgeon shaking his head, the Cockney,\nwith narrow body drawn together, watching, shivering, squatting on toes\nand finger-tips, like a runner about to spring from a mark. Rudolph,\ndizzy with pain and suspense, nursed his forearm mechanically. The\nhurried, silver ring of the hilts dismayed him, the dust from the garden\npath choked him like an acrid smoke.\n\nSuddenly Chantel, dropping low like a deflected arrow, swooped in with\nfingers touching the ground. On \"three feet,\" he had delivered the blow\nso long withheld.\n\nThe watchers shouted. Nesbit sprang up, released. But Heywood, by some\ndesperate sleight, had parried the certainty, and even tried a riposte.\nStill afoot and fighting, he complained testily above the sword-play:--\n\n\"Don't shout like that! Fair field, you chaps!\"\n\nAbove the sword-play, too, came gradually a murmur of voices. Through\nthe dust, beyond the lunging figures, Rudolph was distantly aware of\ncrowded bodies, of yellow faces grinning or agape, in the breach of the\ncompound wall. Men of the neighboring hamlet had gathered, to watch the\nforeign monsters play at this new, fantastic game. Shaven heads bobbed,\nsaffron arms pointed, voices, sharp and guttural, argued scornfully.\n\nThe hilts rang, the blades grated faster. But now it was plain that\nHeywood could do no more, by luck or inspiration. Fretted by his clumsy\nyet strong and close defense, Chantel was forcing on the end. He gave a\npanting laugh. Instantly, all saw the weaker blade fly wide, the\nstronger swerve, to dart in victorious,--and then saw Doctor Chantel\nstaggering backward, struck full in the face by something round and\nheavy. The brown missile skipped along the garden path.\n\nAnother struck a bottle-end, and burst into milk-white fragments, like a\nbomb. A third, rebounding from Teppich's girdle, left him bent and\ngasping. Strange yells broke out, as from a tribe of apes. The air was\nthick with hurtling globes. Cocoanuts rained upon the company,\ntempestuously, as though an invisible palm were shaken by a hurricane.\nAmong them flew sticks, jagged lumps of sun-dried clay, thick scales\nof plaster.\n\n\"Aow!\" cried Nesbit, \"the bloomin' coolies!\" First to recover, he\nskipped about, fielding and hurling back cocoanuts.\n\nA small but raging phalanx crowded the gap in the wall, throwing\ncontinually, howling, and exhorting one another to rush in.\n\n\"A riot!\" cried Heywood, and started, sword in hand. \"Come on, stop\n'em!\"\n\nBut it was Nesbit who, wrenching a pair of loose bottles from the path,\nbrandishing them aloft like clubs, and shouting the unseemly\nbattle-cries of a street-fighter, led the white men into this deadly\nbreach. At the first shock, the rioters broke and scattered, fled round\ncorners of the wall, crashed through bamboos, went leaping across\npaddy-fields toward the river. The tumult--except for lonely howls in\nthe distance--ended as quickly as it had risen. The little band of\nEuropeans returned from the pursuit, drenched with sweat, panting, like\na squad of triumphant football players; but no one smiled.\n\n\"That explains it,\" grumbled Heywood. He pointed along the path to\nwhere, far off, a tall, stooping figure paced slowly toward the town,\nhis long robe a moving strip of color, faint in the twilight. \"The\nSword-Pen dropped some remarks in passing.\"\n\nThe others nodded moodily, too breathless for reply. Nesbit's forehead\nbore an ugly cut, Rudolph's bandage was red and sopping. Chantel, more\nrueful than either, stared down at a bleeding hand, which held two\nshards of steel. He had fallen, and snapped his sword in the rubble of\nold masonry.\n\n\"No more blades,\" he said, like a child with a broken toy; \"there are no\nmore blades this side of Saigon.\"\n\n\"Then we must postpone.\" Heywood mopped his dripping and fiery cheeks.\nHe tossed a piece of silver to one who wailed in the ditch,--a forlorn\nstranger from Hai-nan, lamenting the broken shells and empty baskets of\nhis small venture.--\"Contribution, you chaps. A bad day for imported\ncocoanuts. Wish I carried some money: this chit system is\ndamnable.--Meanwhile, doctor, won't you forget anything I was rude\nenough to say? And come join me in a peg at the club? The heat is\nexcessive.\"\n\n\n\nCHAPTER X\n\n\nTHREE PORTALS\n\nNot till after dinner, that evening, did Rudolph rouse from his stupor.\nWith the clerk, he lay wearily in the upper chamber of Heywood's house.\nThe host, with both his long legs out at window, sat watching the smoky\nlights along the river, and now and then cursing the heat.\n\n\"After all,\" he broke silence, \"those cocoanuts came time enough.\"\n\n\"Didn't they just?\" said Nesbit, jauntily; and fingering the plaster\ncross on his wounded forehead, drawled: \"You might think I'd done a bit\no' dueling myself, by the looks.--But I had _some_ part. Now, that\naccident trick. Rather neat, what? But for me, you might never have\nthought o' that--\"\n\n\"Idiot!\" snapped Heywood, and pulling in his legs, rose and stamped\nacross the room.\n\nA glass of ice and tansan smashed on the floor. Rudolph was on foot,\nclutching his bandaged arm as though the hurt were new.\n\n\"You!\" he stammered. \"You did that!\" He stood gaping, thunderstruck.\n\nFelt soles scuffed in the darkness, and through the door, his yellow\nface wearing a placid and lofty grin, entered Ah Pat, the compradore.\n\n\"One coolie-man hab-got chit.\"\n\nHe handed a note to his master, who snatched it as though glad of the\ninterruption, bent under the lamp, and scowled.\n\nThe writing was in a crabbed, antique German character:--\n\n\"Please to see bearer, in bad clothes but urgent. We are all in danger.\n_Um Gottes willen_--\" It straggled off, illegible. The signature, \"Otto\nWutzler,\" ran frantically into a blot.\n\n\"Can do,\" said Heywood. \"You talkee he, come topside.\"\n\nThe messenger must have been waiting, however, at the stairhead; for no\nsooner had the compradore withdrawn, than a singular little coolie\nshuffled into the room. Lean and shriveled as an opium-smoker, he wore\nloose clothes of dirty blue,--one trousers-leg rolled up. The brown\nface, thin and comically small, wore a mask of inky shadow under a\nwicker bowl hat. His eyes were cast down in a strange fashion, unlike\nthe bold, inquisitive peering of his countrymen,--the more strange, in\nthat he spoke harshly and abruptly, like a racer catching breath.\n\n\"I bring news.\" His dialect was the vilest and surliest form of the\ncolloquial \"Clear Speech.\"--\"One pair of ears, enough.\"\n\n\"You can speak and act more civilly,\" retorted Heywood, \"or taste the\nbamboo.\"\n\nThe man did not answer, or look up, or remove his varnished hat. Still\ndowncast and hang-dog, he sidled along the verge of the shadow, snatched\nfrom the table the paper and a pencil, and choosing the darkest part of\nthe wall, began to write. The lamp stood between him and the company:\nHeywood alone saw--and with a shock of amazement--that he did not print\nvertically as with a brush, but scrawled horizontally. He tossed back\nthe paper, and dodged once more into the gloom.\n\nThe postscript ran in the same shaky hand:--\n\n\"Send way the others both.\"\n\n\"What!\" cried the young master of the house; and then over his shoulder,\n\"Excuse us a moment--me, I should say.\"\n\nHe led the dwarfish coolie across the landing, to the deserted\ndinner-table. The creature darted past him, blew out one candle, and\nthrust the other behind a bottle, so that he stood in a wedge of shadow.\n\n\"Eng-lish speak I ver' badt,\" he whispered; and then with something\nbetween gasp and chuckle, \"but der _pak-wa_ goot, no? When der live\ndependt, zo can mann--\" He caught his breath, and trembled in a\nstrong seizure.\n\n\"Good?\" whispered Heywood, staring. \"Why, man, it's wonderful! You\n_are_ a coolie\"--Wutzler's conical wicker-hat ducked as from a blow. \"I\nbeg your pardon. I mean, you're--\"\n\nThe shrunken figure pulled itself together.\n\n\"You are right,\" he whispered, in the vernacular. \"To-night I am a\ncoolie--all but the eyes. Therefore this hat.\"\n\nHeywood stepped back to the door, and popped his head out. The dim hall\nwas empty.\n\n\"Go on,\" he said, returning. \"What is your news?\"\n\n\"Riots. They are coming. We are all marked for massacre. All day I ran\nabout the town, finding out. The trial of Chok Chung, your--_our_\nChristian merchant--I saw him 'cross the hall.' They kept asking, 'Do\nyou follow the foreign dogs and goats?' But he would only answer, 'I\nfollow the Lord Jesus.' So then they beat out his teeth with a heavy\nshoe, and cast him into prison. Now they wait, to see if his padre will\ninterfere with the law. It is a trap. The suit is certainly brought by\nFang the scholar, whom they call the Sword-Pen.\"\n\n\"That much,\" said Heywood, \"I could have told you.\"\n\nWutzler glanced behind him fearfully, as though the flickering shadows\nmight hear.\n\n\"But there is more. Since dark I ran everywhere, watching, listening to\ngossip. I painted my skin with mangrove-bark water. You know this\nsign?\" He patted his right leg, where the roll of trousers bound his\nthigh. \"It is for protection in the streets. It says, 'I am a\nHeaven-and-Earth man.'\"\n\n\"The Triad!\" Heywood whistled. \"You?\"\n\nThe other faltered, and hung his head.\n\n\"Yes,\" he whispered at last. \"My--my wife's cousin, he is a Grass\nSandal. He taught her the verses at home, for safety.--We mean no harm,\nnow, we of the Triad. But there is another secret band, having many of\nour signs. It is said they ape our ritual. Fang the scholar heads their\nlodge. They are the White Lotus.\"\n\n\"White Lotus?\" Heywood snapped his fingers. \"Nonsense. Extinct, this\nhundred years.\"\n\n\"Extinct? They meet to-night,\" said the outcast, in sudden grief and\npassion. \"They drink blood--plan blood. Extinct? Are _you_ married to\nthese people? Does the knowledge come so cheap, or at a price? All these\nyears--darkness--sunken--alone\"--He trembled violently, but regained his\nvoice. \"O my friend! This very night they swear in recruits, and set the\nday. I know their lodge-room. For any sake, believe me! I know!\"\n\n\"Right,\" said Heywood, curtly. \"I believe you. But why come here? Why\nnot stay, and learn more?\"\n\nWutzler's head dropped on his breast again. The varnished hat gleamed\nsoftly in the darkness.\n\n\"I--I dare not stay,\" he sobbed.\n\n\"Oh, exactly!\" Heywood flung out an impatient arm. \"The date, man! The\nday they set. You came away without it!--We sit tight, then, and wait in\nignorance.\"\n\nThe droll, withered face, suddenly raised, shone with great tears that\nstreaked the mangrove stain.\n\n\"My head sits loosely already, with what I have done to-night. I found a\nlistening place--next door: a long roof. You can hear and see them--But\nI could not stay. Yes, I am a coward.\"\n\n\"There, there!\" Heywood patted his shoulder. \"I didn't mean--Here, have\na drink.\"\n\nThe man drained the tumbler at a gulp; stood without a word, sniffing\nmiserably; then of a sudden, as though the draught had worked, looked up\nbold and shrewd.\n\n\"Do you?\" he whispered. \"Do _you_ dare go to the place I show you, and\nhide? You would learn.\"\n\nHeywood started visibly, paused, then laughed.\n\n\"Excellent,\" he said. \"_Tu quoque_ is good argument. Can you smuggle\nme?--Then come on.\" He stepped lightly across the landing, and called\nout, \"You chaps make yourselves at home, will you? Business, you know.\nWhat a bore! I'll not be back till late.\" And as he followed the\nslinking form downstairs, he grumbled, \"If at all, perhaps.\"\n\nThe moon still lurked behind the ocean, making an aqueous pallor above\nthe crouching roofs. The two men hurried along a \"goat\" path, skirted\nthe town wall, and stole through a dark gate into a darker maze of\nlonely streets. Drawing nearer to a faint clash of cymbals in some\njoss-house, they halted before a blind wall.\n\n\"In the first room,\" whispered the guide, \"a circle is drawn on the\nfloor. Put your right foot there, and say, 'We are all in-the-circle\nmen,' If they ask, remember: you go to pluck the White Lotus. These men\nhate it, they are Triad brothers, they will let you pass. You come from\nthe East, where the Fusang cocks spit orient pearls; you studied in the\nRed Flower Pavilion; your eyes are bloodshot because\"--He lectured\nearnestly, repeating desperate nonsense, over and over. \"No: not so. Say\nit exactly, after me.\"\n\nThey held a hurried catechism in the dark.\n\n\"There,\" sighed Wutzler, at last, \"that is as much as we can hope. Do\nnot forget. They will pass you through hidden ways.--But you are very\nrash. It is not too late to go home.\"\n\nReceiving no answer, he sighed more heavily, and gave a complicated\nknock. Bars clattered within, and a strip of dim light widened. \"Who\ncomes?\" said a harsh but guarded voice, with a strong Hakka brogue.\n\n\"A brother,\" answered the outcast, \"to pluck the White Lotus. Aid,\nbrothers.--Go in, I can help no further. If you are caught, slide down,\nand run westward to the gate which is called the Meeting of\nthe Dragons.\"\n\nHeywood nodded, and slipped in. Beside a leaf-point flame of peanut-oil,\na broad, squat giant sat stiff and still against the opposite wall, and\nstared with cruel, unblinking eyes. If the stranger were the first white\nman to enter, this motionless grim janitor gave no sign. On the earthen\nfloor lay a small circle of white lime. Heywood placed his right foot\ninside it.\n\n\"We are all in-the-circle men.\"\n\n\"Pass,\" said the guard.\n\nOut from shadow glided a tall native with a halberd, who opened a door\nin the far corner.\n\nIn the second room, dim as the first, burned the same smoky orange light\non the same table. But here a twisted <DW36>, his nose long and\npendulous with elephantiasis, presided over three cups of tea set in a\nrow. Heywood lifted the central cup, and drank.\n\n\"Will you bite the clouds?\" asked the second guard, in a soft and husky\nbass. As he spoke, the great nose trembled slightly.\n\n\"No, I will bite ginger,\" replied the white man.\n\n\"Why is your face so green?\"\n\n\"It is a melon-face--a green face with a red heart.\"\n\n\"Pass,\" said the <DW36>, gently. He pulled a cord--the nose quaking\nwith this exertion--and opened the third door.\n\nAgain the chamber was dim. A venerable man in gleaming silks--a\ngrandfather, by his drooping rat-tail moustaches--sat fanning himself.\nIn the breath of his black fan, the lamplight tossed queer shadows\nleaping, and danced on the table of polished camagon. Except for this\nunrest, the aged face might have been carved from yellow soapstone. But\nhis slant eyes were the sharpest yet.\n\n\"You have come far,\" he said, with sinister and warning courtesy.\n\nToo far, thought Heywood, in a sinking heart; but answered:--\n\n\"From the East, where the Fusang cocks spit orient pearls.\"\n\n\"And where did you study?\" The black fan stopped fluttering.\n\n\"In the Red Flower Pavilion.\"\n\n\"What book did you read?\"\n\n\"The book,\" said Heywood, holding his wits by his will, \"the book was\nTen Thousand Thousand Pages.\"\n\n\"And the theme?\"\n\n\"The waters of the deluge crosswise flow.\" \"And what\"--the aged voice\nrose briskly--\"what saw you on the waters?\"\n\n\"The Eight Abbots, floating,\" answered Heywood, negligently.--\"But,\" ran\nhis thought, \"he'll pump me dry.\"\n\n\"Why,\" continued the examiner, \"do you look so happy?\"\n\n\"Because Heaven has sent the Unicorn.\"\n\nThe black fan began fluttering once more. It seemed a hopeful sign; but\nthe keen old eyes were far from satisfied.\n\n\"Why have you such a sensual face?\"\n\n\"I was born under a peach tree.\"\n\n\"Pass,\" said the old man, regretfully. And Heywood, glancing back from\nthe mouth of a dark corridor, saw him, beside the table of camagon,\nwagging his head like a judge doubtful of his judgment.\n\nThe narrow passage, hot, fetid, and blacker than the wholesome night\nwithout, crooked about sharp corners, that bruised the wanderer's hands\nand arms. Suddenly he fell down a short flight of slimy steps, landing\nin noisome mud at the bottom of some crypt. A trap, a suffocating well,\nhe thought; and rose filthy, choked with bitterness and disgust. Only\nthe taunting justice of Wutzler's argument, the retort _ad hominem_, had\nsent him headlong into this dangerous folly. He had scolded a coward\nwith hasty words, and been forced to follow where they led. To this\nloathsome hole. Behind him, a door closed, a bar scraped softly into\nplace. Before him, as he groped in rage and self-reproach, rose a vault\nof solid plaster, narrow as a chimney.\n\nBut presently, glancing upward, he saw a small cluster of stars\nblinking, voluptuous, immeasurably overhead. Their pittance of light, as\nhis eyesight cleared, showed a ladder rising flat against the wall. He\nreached up, grasped the bamboo rungs, hoisted with an acrobatic wrench,\nand began to climb cautiously.\n\nAbove, faint and muffled, sounded a murmur of voices.\n\n\n\nCHAPTER XI\n\n\nWHITE LOTUS\n\nHe was swarming up, quiet as a thief, when his fingers clawed the bare\nplaster. The ladder hung from the square end of a protruding beam, above\nwhich there were no more rungs. He hung in doubt.\n\nThen, to his great relief, something blacker than the starlight gathered\ninto form over his head,--a slanting bulk, which gradually took on a\nfamiliar meaning. He chuckled, reached for it, and fingering the rough\nedge to avoid loose tiles, hauled himself up to a foothold on the beam,\nand so, flinging out his arms and hooking one knee, scrambled over and\nlay on a ribbed and mossy surface, under the friendly stars. The outcast\nand his strange brethren had played fair: this was the long roof, and\nclose ahead rose the wall of some higher building, an upright blackness\nfrom which escaped two bits of light,--a right angle of hairbreadth\nlines, and below this a brighter patch, small and ragged. Here, louder,\nbut confused with a gentle scuffing of feet, sounded the voices of the\nrival lodge.\n\nToward these he crawled, stopping at every creak of the tiles. Once a\nbroken roll snapped off, and slid rattling down the roof. He sat up,\nevery muscle ready for the sudden leap and shove that would send him\nsliding after it into the lower darkness. It fell but a short distance,\ninto something soft. Gradually he relaxed, but lay very still. Nothing\nfollowed; no one had heard.\n\nHe tried again, crawled forward his own length, and brought up snug and\nsafe in the angle where roof met wall. The voices and shuffling feet\nwere dangerously close. He sat up, caught a shaft of light full in his\nface, and peered in through the ragged chink. Two legs in bright,\nwrinkled hose, and a pair of black shoes with thick white soles, blocked\nthe view. For a long time they shifted, uneasy and tantalizing. He could\nhear only a hubbub of talk,--random phrases without meaning. The legs\nmoved away, and left a clear space.\n\nBut at the same instant, a grating noise startled him, directly\noverhead, out of doors. The thin right angle of light spread instantly\ninto a brilliant square. With a bang, a wooden shutter slid open.\nHeywood lay back swiftly, just as a long, fat bamboo pipe, two sleeves,\nand the head of a man in a red silk cap were thrust out into the\nnight air.\n\n\"_Ai-yah!\"_ sighed the man, and puffed at his bamboo. \"It is hot.\"\n\nHeywood tried to blot himself against the wall. The lounger, propped on\nelbows, finished his smoke, spat upon the tiles, and remained, a pensive\nsilhouette.\n\n\"_Ai-yah!\"_ he sighed again; then knocking out the bamboo, drew in his\nhead. Not until the shutter slammed, did Heywood shake the burning\nsparks from his wrist.\n\nIn the same movement, however, he raised head and shoulders to spy\nthrough the chink. This time the bright-hosed legs were gone. He saw\nclear down a brilliant lane of robes and banners, multicolored, and\nshining with embroidery and tinsel,--a lane between two ranks of crowded\nmen, who, splendid with green and blue and yellow robes of ceremony,\nfaced each other in a strong lamplight, that glistened on their oily\ncheeks. The chatter had ceased. Under the crowded rows of shaven\nforeheads, their eyes blinked, deep-set and expectant. At the far end of\nthe loft, through two circular arches or giant hoops of rattan, Heywood\nat last descried a third arch, of swords; beyond this, a tall incense\njar smouldering gray wisps of smoke, beside a transverse table twinkling\nwith candles like an altar; and over these, a black image with a pale,\ncarved face, seated bolt upright before a lofty, intricate, gilded\nshrine of the Patriot War-God.\n\nA tall man in dove-gray silk with a high scarlet turban moved athwart\nthe altar, chanting as he solemnly lifted one by one a row of symbols: a\nround wooden measure, heaped with something white, like rice, in which\nstuck a gay cluster of paper flags; a brown, polished abacus; a mace\ncarved with a dragon, another carved with a phoenix; a rainbow robe,\ngleaming with the plumage of Siamese kingfishers. All these, and more,\nhe displayed aloft and replaced among the candles.\n\nWhen his chant ended, a brisk little man in yellow stepped forward into\nthe lane.\n\n\"O Fragrant Ones,\" he shrilled, \"I bring ten thousand recruits, to join\nour army and swear brotherhood. Attend, O Master of Incense.\"\n\nBehind him, a squad of some dozen barefoot wretches, in coolie clothes,\nwith queues un-plaited, crawled on all fours through the first arch.\nThey crouched abject, while the tall Master of Incense in the dove-gray\nsilk sternly examined their sponsor.\n\nIn the outer darkness, Heywood craned and listened till neck and\nshoulders ached. He could make nothing of the florid verbiage.\n\nWith endless ritual, the crawling novices reached the arch of swords.\nThey knelt, each holding above his head a lighted bundle of\nincense-sticks,--red sparks that quivered like angry fireflies. Above\nthem the tall Master of Incense thundered:--\n\n\"O Spirits of the Hills and Brooks, the Land, the swollen seeds of the\nground, and all the Veins of Earth; O Thou, young Bearer of the Axe that\ncleared the Hills; O Imperial Heaven, and ye, Five Dragons of the Five\nRegions, with all the Holy Influences who pass and instantly re-pass\nthrough unutterable space:--draw near, record our oath, accept the\ndraught of blood.\"\n\nHe raised at arm's length a heavy baton, which, with a flowing movement,\nunrolled to the floor a bright yellow scroll thickly inscribed. From\nthis he read, slowly, an interminable catalogue of oaths. Heywood could\ncatch only the scolding sing-song of the responses:--\n\n\"If any brother shall break this, let him die beneath ten thousand\nknives.\"\n\n\"--Who violates this, shall be hurled down into the great sky.\"\n\n\"--Let thunder from the Five Regions annihilate him.\"\n\nSilence followed, broken suddenly by the frenzied squawking of a fowl,\nas suddenly cut short. Near the chink, Heywood heard a quick struggling\nand beating. Next instant he lay flattened against the wall.\n\nThe shutter grated open, a flood of light poured out.\n\nWithin reach, in that radiance, a pair of sinewy yellow hands gripped\nthe neck of a white cock. The wretched bird squawked once more, feebly,\nflapped its wings, and clawed the air, just as a second pair of arms\nreached out and sliced with a knife. The cock's head flew off upon the\ntiles. Hot blood spattered on Heywood's cheek. Half blinded, but not\ndaring to move, he saw the knife withdrawn, and a huge goblet held out\nto catch the flow. Then arms, goblet, and convulsive wings jerked out of\nsight, and the shutter slid home.\n\n\"Twice they've not seen me,\" thought Heywood. It was darker, here, than\nhe had hoped. He rose more boldly to the peep-hole.\n\nUnder the arch of swords, the new recruits, now standing upright,\nstretched one by one their wrists over the goblet. The Incense Master\npricked each yellow arm, to mingle human blood with the blood of the\nwhite cock; then, from a brazen vessel, filled the goblet to the brim.\nIt passed from hand to hand, like a loving-cup. Each novice raised it,\nchanted some formula, and drank. Then all dispersed. There fell\na silence.\n\nSuddenly, in the pale face of the black image seated before the shrine,\nthe eyes turned, scanning the company with a cold contempt. The lips\nmoved. The voice, level and ironic, was that of Fang, the Sword-Pen:--\n\n\"O Fragrant Ones, when shall the foreign monsters perish like this\ncock?\"\n\nA man in black, with a red wand, bowed and answered harshly:--\n\n\"The time, Great Elder Brother, draws at hand.\"\n\n\"How shall we know the hour?\"\n\n\"The hour,\" replied the Red Wand, \"shall be when the Black Dog barks.\"\n\n\"And the day?\"\n\nHeywood pressed his ear against the chink, and listened, his five senses\nfused into one.\n\nNo answer came, but presently a rapid, steady clicking, strangely\nfamiliar and commonplace. He peered in again. The Red Wand stood by the\nabacus, rattling the brown beads with flying fingers, like a shroff.\nPlainly, it was no real calculation, but a ceremony before the answer.\nThe listener clapped his ear to the crevice. Would that answer, he\nwondered, be a month, a week, to-morrow?\n\nThe shutter banged, the light streamed, down went Heywood against the\nplaster. Thick dregs from the goblet splashed on the tiles. A head, the\nflattened profile of the brisk man in yellow, leaned far out from the\nlittle port-hole. Grunting, he shook the inverted cup, let it dangle\nfrom his hands, stared up aimlessly at the stars, and then--to Heywood's\nconsternation--dropped his head to meditate, looking straight down.\n\n\"He sees me,\" thought Heywood, and held himself ready, trembling. But\nthe fellow made no sign, the broad squat features no change. The pose\nwas that of vague, comfortable thought. Yet his vision seemed to rest,\ntrue as a plumb-line, on the hiding-place. Was he in doubt?--he could\nreach down lazily, and feel.\n\nWorst of all, the greenish pallor in the eastern sky had imperceptibly\nturned brighter; and now the ribbed edge of a roof, across the way,\nbegan to glow like incandescent silver. The moon was crawling up.\n\nThe head and the dangling goblet were slowly pulled in, just before the\nmoonlight, soft and sullen through the brown haze of the heat, stole\ndown the wall and spread upon the tiles. The shutter remained open. But\nHeywood drew a free breath: those eyes had been staring into vacancy.\n\n\"Now, then,\" he thought, and sat up to the cranny; for the rattle of the\nabacus had stopped.\n\n\"The counting is complete,\" announced the Red Wand slowly, \"the hours\nare numbered. The day--\"\n\nMovement, shadow, or nameless instinct, made the listener glance upward\nswiftly. He caught the gleam of yellow silk, the poise and downward jab,\nand with a great heave of muscles went shooting down the slippery\nchannel of the cock's blood. A spearhead grazed his scalp, and smashed\na tile behind him. As he rolled over the edge, the spear itself whizzed\nby him into the dark.\n\n\"The chap saw,\" he thought, in mid-air; \"beastly clever--all the time--\"\n\nHe landed on the spear-shaft, in a pile of dry rubbish, snatched up the\nweapon, and ran, dimly conscious of a quiet scurrying behind and above\nhim, of silent men tumbling after, and doors flung violently open.\n\nHe raced blindly, but whipped about the next corner, leaving the moon at\nhis back. Westward, somebody had told him, to the gate where\ndragons met.\n\nThere had been no uproar; but running his hardest down the empty\ncorridors of the streets, he felt that the pack was gaining. Ahead\nloomed something gray, a wall, the end of a blind alley. Scale it, or\nmake a stand at the foot,--he debated, racing. Before the decision came,\na man popped out of the darkness. Heywood shifted his grip, drew back\nthe spear, but found the stranger bounding lightly alongside, and\nmuttering,--\n\n\"To the west-south, quick! A brother waits. I fool those who follow--\"\n\nObeying, Heywood dove to the left into the black slit of an alley, while\nthe other fugitive pattered straight on into the seeming trap, with a\nyelp of encouragement to the band who swept after. The alley was too\ndark for speed. Heywood ran on, fell, rose and ran, fell again, losing\nhis spear. A pair of trembling hands eagerly helped him to his feet.\n\n\"My cozin's boy, he ron quick,\" said Wutzler. \"Dose fellows, dey not\ncatch him! Kom.\"\n\nThey threaded the gloom swiftly. Wutzler, ready and certain of his\nground, led the tortuous way through narrow and greasy galleries, along\nthe side of a wall, and at last through an unlighted gate, free of\nthe town.\n\nIn the moonlight he stared at his companion, cackled, clapped his\nthighs, and bent double in unholy convulsions.\n\n\"My gracious me!\" He laughed immoderately. \"Oh, I wait zo fearful, you\nkom zo fonny!\" For a while he clung, shaking, to the young man's arm.\n\"My friendt, zo fonny you look! My gootness me!\" At last he regained\nhimself, stood quiet, and added very pointedly, \"What did _yow_ lern?\"\n\n\"Nothing,\" replied Heywood, angrily. \"Nothing. Fragrant Ones! Not a bad\nname. Phew!--Oh, I say, what did they mean? What Black Dog is to bark?\"\n\n\"Black Dog? Black Dog iss cannon.\" The man became, once more, as keen as\na gossip. \"What cannon? When dey shoot him off?\"\n\n\"Can't tell,\" said his friend. \"That's to be their signal.\"\n\n\"I do not know,\" The conical hat wagged sagely. \"I go find out.\" He\npointed across the moonlit spaces. \"Ofer dere iss your house. You can no\nmore. _Schlafen Sie wohl_.\"\n\nThe two men wrung each other's hands.\n\n\"Shan't forget this, Wutz.\"\n\n\"Oh, for me--all you haf done--\" The outcast turned away, shaking his\nhead sadly.\n\nNever did Heywood's fat water-jar glisten more welcome than when he\ngained the vaulted bath-room. He ripped off his blood-stained clothes,\nscrubbed the sacrificial clots from his hair, and splashed the cool\nwater luxuriously over his exhausted body. When at last he had thrown a\nkimono about him, and wearily climbed the stairs, he was surprised to\nsee Rudolph, in the white-washed room ahead, pacing the floor and\nardently twisting his little moustache. As Heywood entered, he wheeled,\nstared long and solemnly.\n\n\"I must wait to tell you.\" He stalked forward, and with his sound left\nhand grasped Heywood's right. \"This afternoon, you--\"\n\n\"My dear boy, it's too hot. No speeches.\"\n\nBut Rudolph's emotion would not be hindered.\n\n\"This afternoon,\" he persisted, with tragic voice and eyes, \"this\nafternoon I nearly was killed.\"\n\n\"So was I.--Which seems to meet that.\" And Heywood pulled free.\n\n\"Oh,\" cried Rudolph, fervently. \"I know! I feel--If you knew what I--My\nlife--\"\n\nThe weary stoic in the blue kimono eyed him very coldly, then plucked\nhim by the sleeve.--\"Come here, for a bit.\"\n\nBoth men leaned from the window into the hot, airless night. A Chinese\nrebeck wailed, monotonous and nasal. Heywood pointed at the moon, which\nnow hung clearly above the copper haze.\n\n\"What do you see there?\" he asked dryly.\n\n\"The moon,\" replied his friend, wondering.\n\n\"Good.--You know, I was afraid you might just see Rudie Hackh.\"\n\nThe rebeck wailed a long complaint before he added:--\n\n\"If I didn't like you fairly well--The point is--Good old Cynthia! That\nbally orb may not see one of us to-morrow night, next week, next\nquarter. 'Through this same Garden, and for us in vain.' Every man Jack.\nLet me explain. It will make you better company.\"\n\n\n\nCHAPTER XII\n\n\nTHE WAR BOARD\n\n\"Rigmarole?\" drawled Heywood, and abstained from glancing at Chantel.\n\"Dare say. However, Gilly, their rigmarole _may_ mean business. On that\nsupposition, I made my notes urgent to you chaps.\"\n\n\"Quite right,\" said Mr. Forrester, tugging his gray moustache, and\nstudying the floor. \"Obviously. Rigmarole or not, your plan is\nthoroughly sound: stock one house, and if the pinch comes, fortify.\"\n\nChantel drummed on Heywood's long table, and smiled quaintly, with eyes\nwhich roved out at window, and from mast to bare mast of the few small\njunks that lay moored against the distant bank. He bore himself, to-day,\nlike a lazy cock of the walk. The rest of the council, Nesbit, Teppich,\nSturgeon, Kempner, and the great snow-headed padre, surrounded the table\nwith heat-worn, thoughtful faces. When they looked up, their eyes went\nstraight to Heywood at the head; so that, though deferring to his\nelders, the youngest man plainly presided.\n\nChantel turned suddenly, merrily, his teeth flashing in a laugh.\n\n\"If we are then afraid, let us all take a jonc down the river,\" he\nscoffed, \"or the next vessel for Hongkong!\"\n\nGilly's tired, honest eyes saw only the plain statement.\n\n\"Impossible.\" He shook his bullet head. \"We can't run away from a rumor,\nyou know. Can we, now? The women, perhaps. But we should lose face no\nend--horribly.\"\n\n\"Let's come to facts,\" urged Heywood. \"Arms, for example. What have we?\nTo my knowledge, one pair of good rifles, mine and Sturgeon's.\nAmmunition--uncertain, but limited. Two revolvers: my Webley.450, and\nthat little thing of Nesbit's, which is not man-stopping. Shot-guns?\nEvery one but you, padre: fit only for spring snipe, anyway, or bamboo\npartridge. Hackh has just taken over, from this house, the only real\nweapons in the settlement--one dozen old Mausers, Argentine, calibre.765.\nMy predecessor left 'em, and three cases of cartridges. I've kept\nthe guns oiled, and will warrant the lot sound.--Now, who'll lend me\nspare coolies, and stuff for sand-bags?\"\n\n\"Over where?\" puffed Sturgeon. \"Where's he taking your Mausers?\"\n\n\"Nunnery, of course.\"\n\n\"Oh, I say!\" Mr. Forrester looked up, with an injured air. \"As the\nsenior here, except Dr. Earle, I naturally thought the choice would be\nmy house.\"\n\n\"Right!\" cried two or three voices from the foot of the table. \"It\nshould be--Farthest off--\"\n\nAll talked at once, except Chantel, who eyed them leniently, and smiled\nas at so many absurd children. Kempner--a pale, dogged man, with a\npompous white moustache which pouted and bristled while he spoke--rose\nand delivered a pointless oration. \"Ignoring race and creed,\" he droned,\n\"we must stand together--\"\n\nHeywood balanced a pencil, twirled it, and at last took to drawing. On\nthe polished wood he scratched, with great pains, the effigy of a pig,\nwhose snout blared forth a gale of quarter-notes.\n\n\"Whistle away!\" he muttered; then resumed, as if no one had interrupted:\n\"Very good of you, Gilly. But with your permission, I see five\npoints.--Here's a rough sketch, made some time ago.\"\n\nHe tossed on the table a sheet of paper. Forrester spread it, frowning,\nwhile the others leaned across or craned over his chair.\n\n\"All out of whack, you see,\" explained the draughtsman; \"but here are my\npoints, Gilly. One: your house lies quite inland, with four sides to\ndefend: the river and marsh give Rudie's but two and a fraction. Boats?\nNot hardly: we'd soon stop that, as you'll see, if they dare.\nAnyhow,--point two,--your house is all hillocks behind, and shops\nroundabout: here's just one low ridge, and the rest clear field. Third:\nthe Portuguese built a well of sorts in the courtyard; water's deadly, I\ndare say, but your place has no well whatever. And as to four,\nsuppose--in a sudden alarm, say, those cut off by land could run another\nhalf-chance to reach the place by river.--By the way, the nunnery has a\nbell to ring.\"\n\nGilbert Forrester shoved the map along to his neighbor, and cleared his\nthroat.\n\n\"Gentlemen,\" he declared slowly, \"you once did me the honor to say that\nin--in a certain event, you would consider me as acting head. Frankly, I\nconfess, my plans were quite--ah!--vague. I wish to--briefly, to resign,\nin favor of this young--ah--bachelor.\"\n\n\"Don't go rotting me,\" complained Heywood, and his sallow cheeks turned\nruddy. \"I merely bring up these points. And five is this: your\ncompound's very cramped, where the nunnery could shelter the goodly\nblooming fellowship of native converts.\"\n\nChantel laughed heartily, and stretched his legs at ease under the\ntable.\n\n[Illustration: Portuguese Nunnery:--Sketch Map.]\n\n\"What strategy!\" he chuckled, preening his moustache. \"Your mythical\nsiege--it will be brief! For me, I vote no to that: no rice-Christians\nfilling their bellies--eating us into a surrender!\" He made a pantomime\nof chop-sticks. \"A compound full, eating, eating!\"\n\nOne or two nodded, approving the retort. Heywood, slightly lifting his\nchin, stared at the speaker coldly, down the length of their\ncouncil-board. The red in his cheeks burned darker.\n\n\"Our everlasting shame, then,\" he replied quietly. \"It will be\neverlasting, if we leave these poor devils in the lurch, after cutting\nthem loose from their people. Excuse me, padre, but it's no time to\nmince our words. We made them strangers in their own land. Desert 'em?\nDamned if we do!\"\n\nNo one made reply. The padre, who had looked up, looked down quickly,\nmusing, and smoothed his white hair with big fingers that\nsomewhat trembled.\n\n\"Besides,\" continued the speaker, in a tone of apology, \"we'll need 'em\nto man the works. Meantime, you chaps must lend coolies, eh? Look here.\"\nWith rising spirits, he traced an eager finger along the map. \"I must\nrun a good strong bamboo scaffold along the inside wall, with plenty of\nsand-bags ready for loopholing--specially atop the servants' quarters\nand pony-shed, and in that northeast angle, where we'll throw up a\nmound or platform.--What do you say? Suggestions, please!\"\n\nChantel, humming a tune, reached for his helmet, and rose. He paused,\nstruck a match, and in an empty glass, shielding the flame against the\nbreeze of the punkah, lighted a cigarette.\n\n\"Since we have appointed our dictator,\" he began amiably, \"we may\nrepose--\"\n\nFrom the landing, without, a coolie bawled impudently for the master of\nthe house.\n\n\"Wutzler!\" said Heywood, jumping up. \"I mean--his messenger.\"\n\nHe was gone a noticeable time, but came back smiling.\n\n\"Good news, Gilly.\" He held aloft a scrap of Chinese paper, scrawled on\nwith pencil. \"We need expect nothing these ten days. They wait for more\nammunition--'more shoots,' the text has it. The Hak Kau--their Black\nDog--is a bronze cannon, nine feet long, cast at Rotterdam in 1607. He\nwrites, 'I saw it in shed last night, but is gone to-day. O.W.'\nGentlemen, for a timid man, our friend does not scamp his reports.\nThorough, rather? Little O.W. is O.K.\"\n\nChantel, still humming, had moved toward the door. All at once he\nhalted, and stared from the landward window. Cymbals clashed\nsomewhere below.\n\n\"What's this?\" he cried sharply. The noise drew nearer, more brazen,\nand with it a clatter of hoofs. \"Here come swordsmen!\"\n\n\"To play with you, I suppose. Your fame has spread.\" Heywood spoke with\na slow, mischievous drawl; but he crossed the room quickly. \"What's up?\"\n\nBelow, by the open gate, a gay grotesque rider reined in a piebald pony,\nand leaning down, handed to the house-boy a ribbon of scarlet paper.\nBehind him, to the clash of cymbals, a file of men in motley robes\nswaggered into position, wheeled, and formed the ragged front of a\nFalstaff regiment. Overcome by the scarlet ribbon, the long-coated \"boy\"\nbowed, just as through the gate, like a top-heavy boat swept under an\narch, came heaving an unwieldy screened chair, borne by four broad men:\nnot naked and glistening coolies, but \"Tail-less Horses\" in proud\nlivery. Before they could lower their shafts, Heywood ran clattering\ndown the stairs.\n\nSlowly, cautiously, like a little fat old woman, there clambered out\nfrom the broadcloth box a rotund man, in flowing silks, and a conical,\ntasseled hat of fine straw. He waddled down the compound path, shading\nwith his fan a shrewd, bland face, thoughtful, yet smooth as a babe's.\n\nThe watchers in the upper room saw Heywood greet him with extreme\nceremony, and heard the murmur of \"Pray you, I pray you,\" as with\nendless bows and deprecations the two men passed from sight, within the\nhouse. A long time dragged by. The visitor did not join the company, but\nfrom another room, now and then, sounded his clear-pitched voice, full\nof odd and courteous modulations. When at last the conference ended, and\ntheir unmated footsteps crossed the landing, a few sentences echoed from\nthe stairway.\n\n\"That is all,\" declared the voice, pleasantly. \"The Chow Ceremonial\nsays, 'That man is unwise who knowingly throws away precious things.'\nAnd in the Analects we read, 'There is merit in dispatch.'\"\n\nHeywood's reply was lost, except the words, \"stupid people.\"\n\n\"In every nation,\" agreed the placid voice. \"It is true. What says the\nViceroy of Hupeh: 'They see a charge of bird-shot, and think they are\ntasting broiled owl.'--Walk slowly!\"\n\n\"A safe walk, Your Excellency.\"\n\nThe cymbals struck up, the cavalcade, headed by ragamuffin lictors with\nwhips, went swaying past the gate. Heywood, when he returned,\nwas grinning.\n\n\"Wonderful old chap!\" he exclaimed. \"Hates this station, I fancy, much\nas we hate it.\"\n\n\"Anything to concern us?\" asked Gilly.\n\n\"Intimated he could beat me at chess,\" laughed the young man, \"and will\nbet me a jar of peach wine to a box of Manila cigars!\"\n\nChantel, from a derisive dumb-show near the window, had turned to waddle\nsolemnly down the room. At sight of Heywood's face he stopped guiltily.\n\n\"Chantel!\" All the laughter was gone from the voice and the hard gray\neyes. \"Yesterday we humored you tin-soldier fashion, but to-day let's\nput away childish things.--I like that magistrate, plainly, a damned\ndeal better than I like you. When you or I show one half his ability,\nwe're free to mock him--in my house.\"\n\nFor the first time within the memory of any man present, the mimic\nwilted.\n\n\"I--I did not know,\" he stammered, \"that old man was your friend.\" Very\nquiet, and a little flushed, he took his seat among the others.\n\n\"I like him no end.\" Still more quiet, Heywood appealed to the company.\n\"Part for his hard luck--stuck down, a three-year term, in this\nneglected hole. Enemies in power, higher up. Fang, the Sword-Pen, in\ngreat favor up there.--What? Oh, said nothing directly, of course.\nFriendly call, and all that. But his indirections speak straight enough.\nWe understood each other. The dregs of the town are all stirred\nup--bottomside topside--danger point. He, in case--you know--can't give\nus any help. No means, no recourse. His chief's fairly itching to\ncashier him.--Spoke highly of your hospital work, padre, but said, 'Even\ngood deeds may be misconstrued.'--In short, gentlemen, without saying a\nword, he tells us honestly in plain terms, 'Sorry, but look out for\nyourselves.'\"\n\nA beggar rattled his bowl of cash in the road, below; from up the river\nsounded wailing cries.\n\n\"Did he mention,\" said the big padre, presently, \"the case against my\nman, Chok Chung?\"\n\nHeywood's eyes became evasive, his words reluctant.\n\n\"The magistrate dodged that--that unpleasant subject. The case was\nforced on him. Some understrapper tried it. Let's be fair.\"\n\nDr. Earle's great elbows left the board. Without rising, he seemed to\ngrow in bulk and stature, and send his vision past the company, into\nthose things which are not, to confound the things which are.\n\n\"For myself, it does not matter. 'He buries His workmen, but carries on\nHis work.'\" The man spoke in a heavy, broken voice, as though it were\nhis body that suffered. \"But it comes hard to hear, from a young man, so\ngood a friend, after many years\"--The deep-set eyes returned, and with a\nsudden lustre, made a sharp survey from face to face. \"If I have made my\nflock a remnant--aliens--rejected--tell me, what shall I do? Tell me. I\nhave shut eyes and conscience, and never meddled, never!--not even when\nmoney was levied for the village idols. And here's a man beaten, cast\ninto prison--\"\n\nHe shoved both fists out on the table, and bowed his white head.\n\n\"My safety is nothing. But yours--and his.--To keep one, I desert the\nother. Either way.\" The padre groaned. \"What must I choose?\"\n\n\"We're all quite helpless,\" said Heywood, gently. \"Quite. It's a long\nway to the nearest gunboat.\"\n\n\"Tell me,\" repeated the other, stubbornly.\n\nAt the same moment it happened that the cries came louder along the\nriver-bank, and that some one bounded up the stairs.\n\nThe runner was Rudolph. All morning he had gone about his errands very\ncalmly, playing the man of action, in a new philosophy learned\novernight. But now he forgot to imitate his teacher, and darted in, so\nheadlong that all the dogs came with him, bouncing and barking.\n\n\"Look,\" he called, stumbling toward the farther window, while Flounce\nthe ter"}